Repository: 2dust/v2rayN
Catalog: v2rayN/ServiceLib/Resx/ResUI.*.resx
Languages: fa_ir, fr, hu, ru, zh_hans

# menuSystemProxyNothing
source: Do not change system proxy
fa_ir: پروکسی سیستم تغییر نکند
fr: Ne pas modifier le proxy système
hu: Ne változtassa meg a rendszerproxyt
ru: Не менять системный прокси
zh_hans: 不改变系统代理

# menuSystemProxyPac
source: PAC mode
fa_ir: حالت Pac
fr: Mode PAC
hu: PAC mód
ru: Режим PAC
zh_hans: Pac 模式

# menuSystemProxySet
source: Set system proxy
fa_ir: تنظیم پراکسی سیستم
fr: Configuration auto proxy système
hu: Rendszerproxy beállítása
ru: Установить системный прокси
zh_hans: 自动配置系统代理

# TbSettingsColor
source: Color
fa_ir: رنگ
fr: Couleur
hu: Szín
ru: Цвет
zh_hans: 颜色

# TbSettingsLanguage
source: Language (Restart)
fa_ir: زبان
fr: Langue (redémarrage requis)
hu: Nyelv (Újraindítás)
ru: Язык (требуется перезапуск)
zh_hans: 语言 (需重启)

# menuAddServerViaClipboard
source: Import Share Links from clipboard (Ctrl+V)
fa_ir: وارد کردن URL انبوه از کلیپ بورد
fr: Importer des liens depuis le presse-papiers (Ctrl+V)
hu: Megosztási linkek importálása vágólapról (Ctrl+V)
ru: Импорт массива URL из буфера обмена (Ctrl+V)
zh_hans: 从剪贴板导入分享链接 (Ctrl+V)

# menuAddServerViaScan
source: Scan QR code on the screen (Ctrl+S)
fa_ir: اسکن کد QR روی صفحه
fr: Scanner le QR code à l’écran (Ctrl+S)
hu: QR kód beolvasása a képernyőről (Ctrl+S)
ru: Сканировать QR-код с экрана (Ctrl+S)
zh_hans: 扫描屏幕上的二维码 (Ctrl+S)

# menuCopyServer
source: Clone selected Configuration
fa_ir: سرور انتخاب شده را شبیه سازی کنید
fr: Cloner la sélection
hu: Kijelölt konfiguráció klónozása
ru: Клонировать выбранный сервер
zh_hans: 克隆所选配置文件

# menuRemoveDuplicateServer
source: Remove duplicate Configurations
fa_ir: سرورهای تکراری را حذف کنید
fr: Supprimer les doublons
hu: Ismétlődő konfigurációk eltávolítása
ru: Удалить дубликаты серверов
zh_hans: 移除重复的配置文件

# menuRemoveServer
source: Remove selected Configurations (Delete)
fa_ir: حذف سرورهای انتخابی
fr: Supprimer la sélection (multi-sélection) (Delete)
hu: Kijelölt konfigurációk eltávolítása (Delete)
ru: Удалить выбранные серверы (Delete)
zh_hans: 移除所选配置文件 (多选) (Delete)

# menuSetDefaultServer
source: Set as active Configuration (Enter)
fa_ir: به عنوان سرور فعال تنظیم کنید
fr: Définir comme actif (Entrée)
hu: Beállítás aktív konfigurációként (Enter)
ru: Установить как активный сервер (Enter)
zh_hans: 设为活动配置文件 (Enter)

# menuClearServerStatistics
source: Clear all service statistics
fa_ir: تمام آمار خدمات را پاک کنید
fr: Effacer toutes les statistiques de service
hu: Összes szolgáltatás statisztika törlése
ru: Очистить всю статистику
zh_hans: 清除所有服务统计数据

# menuRealPingServer
source: Test Configurations real delay (Ctrl+R)
fa_ir: آزمایش سرورها با تاخیر واقعی
fr: Tester la latence de connexion réelle (multi-sélect) (Ctrl+R)
hu: Konfigurációk valós késleltetésének tesztelése (Ctrl+R)
ru: Тест на реальную задержку сервера (Ctrl+R)
zh_hans: 测试配置文件真连接延迟 (多选) (Ctrl+R)

# menuSortServerResult
source: Sort by test result
fa_ir: مرتب سازی بر اساس نتیجه تست
fr: Trier selon les résultats de test
hu: Rendezés teszteredmény szerint
ru: Сортировать по результату теста
zh_hans: 按测试结果排序

# menuSpeedServer
source: Test Configurations download speed (Ctrl+T)
fa_ir: تست سرعت دانلود سرورها
fr: Tester la vitesse (multi-sélection) (Ctrl+T)
hu: Konfigurációk letöltési sebességének tesztelése (Ctrl+T)
ru: Тест на скорость загрузки сервера (Ctrl+T)
zh_hans: 测试配置文件速度 (多选) (Ctrl+T)

# menuTcpingServer
source: Test Configurations with tcping (Ctrl+O)
fa_ir: تست سرورها با tcping
fr: Tester la latence Tcping (multi-sélection) (Ctrl+O)
hu: Konfigurációk tesztelése tcpinggel (Ctrl+O)
ru: Тест задержки с tcping (Ctrl+O)
zh_hans: 测试配置文件延迟 Tcping (多选) (Ctrl+O)

# menuExport2ClientConfig
source: Export selected Configuration for complete configuration
fa_ir: سرور انتخابی را برای پیکربندی کلاینت صادر کنید
fr: Exporter la configuration complète sélectionnée
hu: Kijelölt konfiguráció exportálása teljes konfigurációként
ru: Экспортировать выбранный сервер для клиента
zh_hans: 导出所选配置文件完整配置

# menuExport2ShareUrl
source: Export Share Link to Clipboard (Ctrl+C)
fa_ir: URL های اشتراک گذاری را به کلیپ بورد صادر کنید
fr: Exporter les liens de partage vers le presse-papiers (multi-sélection) (Ctrl+C)
hu: Megosztási link exportálása vágólapra (Ctrl+C)
ru: Экспорт URL-адресов общего доступа в буфер обмена (Ctrl+C)
zh_hans: 导出分享链接至剪贴板 (多选) (Ctrl+C)

# menuAddCustomServer
source: Add a custom configuration Configuration
fa_ir: یک سرور پیکربندی سفارشی اضافه شود
fr: Ajouter une configuration personnalisée
hu: Egyéni konfiguráció hozzáadása
ru: Добавить сервер пользовательской конфигурации
zh_hans: 添加自定义配置文件

# menuAddShadowsocksServer
source: Add [Shadowsocks] Configuration
fa_ir: سرور [شادوساکس] را اضافه کنید
fr: Ajouter [Shadowsocks]
hu: [Shadowsocks] konfiguráció hozzáadása
ru: Добавить сервер [Shadowsocks]
zh_hans: 添加 [Shadowsocks] 配置文件

# menuAddSocksServer
source: Add [SOCKS] Configuration
fa_ir: سرور [ساکس] را اضافه کنید
fr: Ajouter [SOCKS]
hu: [SOCKS] konfiguráció hozzáadása
ru: Добавить сервер [SOCKS]
zh_hans: 添加 [SOCKS] 配置文件

# menuAddTrojanServer
source: Add [Trojan] Configuration
fa_ir: سرور [تروجان] را اضافه کنید
fr: Ajouter [Trojan]
hu: [Trojan] konfiguráció hozzáadása
ru: Добавить сервер [Trojan]
zh_hans: 添加 [Trojan] 配置文件

# menuAddVlessServer
source: Add [VLESS] Configuration
fa_ir: سرور [VLESS] را اضافه کنید
fr: Ajouter [VLESS]
hu: [VLESS] konfiguráció hozzáadása
ru: Добавить сервер [VLESS]
zh_hans: 添加 [VLESS] 配置文件

# menuAddVmessServer
source: Add [VMess] Configuration
fa_ir: سرور [VMess] را اضافه کنید
fr: Ajouter [VMess]
hu: [VMess] konfiguráció hozzáadása
ru: Добавить сервер [VMess]
zh_hans: 添加 [VMess] 配置文件

# menuSelectAll
source: Select all (Ctrl+A)
fa_ir: انتخاب همه
fr: Tout sélectionner (Ctrl+A)
hu: Összes kijelölése (Ctrl+A)
ru: Выбрать все (Ctrl+A)
zh_hans: 全选 (Ctrl+A)

# menuMsgViewClear
source: Clear all
fa_ir: همه را پاک کن
fr: Tout effacer
hu: Összes törlése
ru: Очистить все
zh_hans: 清除所有

# menuMsgViewCopy
source: Copy (Ctrl+C)
fa_ir: کپی
fr: Copier (Ctrl+C)
hu: Másolás (Ctrl+C)
ru: Скопировать (Ctrl+C)
zh_hans: 复制 (Ctrl+C)

# menuMsgViewCopyAll
source: Copy all
fa_ir: کپی همه
fr: Tout copier
hu: Összes másolása
ru: Скопировать все
zh_hans: 复制所有

# menuMsgViewSelectAll
source: Select all (Ctrl+A)
fa_ir: انتخاب همه
fr: Tout sélect (Ctrl+A)
hu: Összes kijelölése (Ctrl+A)
ru: Выбрать все (Ctrl+A)
zh_hans: 全选 (Ctrl+A)

# menuSubAdd
source: Add
fa_ir: اضافه کردن
fr: Ajouter
hu: Hozzáadás
ru: Добавить
zh_hans: 添加

# menuSubDelete
source: Delete
fa_ir: حذف
fr: Supprimer
hu: Törlés
ru: Удалить
zh_hans: 删除

# menuSubEdit
source: Edit
fa_ir: ویرایش
fr: Éditer
hu: Szerkesztés
ru: Редактировать
zh_hans: 编辑

# menuSubShare
source: Share
fa_ir: اشتراک
fr: Partager
hu: Megosztás
ru: Поделиться
zh_hans: 分享

# LvEnabled
source: Enable update
fa_ir: به روز رسانی فعال شد
fr: Activer les mises à jour
hu: Frissítés engedélyezése
ru: Включены обновления
zh_hans: 启用更新

# LvSort
source: Sort
fa_ir: مرتب سازی
fr: Tri
hu: Rendezés
ru: Сортировка
zh_hans: 排序

# LvUserAgent
source: User Agent
fa_ir: عامل کاربر
fr: User-Agent (optionnel)
ru: Заголовок User-Agent
zh_hans: User Agent (可选)

# TbCancel
source: Cancel
fa_ir: لغو
fr: Annuler
hu: Mégsem
ru: Отмена
zh_hans: 取消

# TbConfirm
source: Confirm
fa_ir: تایید
fr: OK
hu: Megerősítés
ru: Подтвердить
zh_hans: 确定

# GbTransport
source: Transport
fa_ir: انتقال
fr: Méthode de transport sous-jacente (transport)
hu: Szállítás
ru: Транспорт
zh_hans: 底层传输方式 (transport)

# TbAddress
source: Address
fa_ir: آدرس
fr: Adresse (address)
hu: Cím
ru: Адрес
zh_hans: 地址 (address)

# TbAllowInsecure
source: Allow Insecure
fa_ir: اعطای مجوز ناامن
fr: Ignorer la vérification du certificat (allowInsecure)
hu: Nem biztonságos engedélyezése
ru: Разрешить небезопасные
zh_hans: 跳过证书验证 (allowInsecure)

# TbAlterId
source: Alter ID
fr: ID supplémentaire (alterId)
zh_hans: 额外 ID (alterId)

# TbFingerprint
source: Fingerprint
fa_ir: اثرانگشت
fr: Empreinte (fingerprint)
hu: Ujjlenyomat
ru: Отпечаток

# TbHeaderType
source: Camouflage type
fa_ir: نوع Camouflage
fr: Type de camouflage (type)
hu: Álcázási típus
ru: Тип камуфляжа
zh_hans: 伪装类型 (type)

# TbId
source: UUID(id)
fr: ID utilisateur (id)
zh_hans: 用户 ID (id)

# TbNetwork
source: Transport protocol(network)
fa_ir: پروتکل جابجایی (شبکه)
fr: Protocole (network)
hu: Szállítási protokoll(hálózat)
ru: Транспортный протокол сети
zh_hans: 传输协议 (network)

# TbPath
source: Path
fa_ir: مسیر
fr: Chemin (path)
hu: Elérési út
ru: Путь
zh_hans: 路径 (path)

# TbPort
source: Port
fa_ir: پورت
fr: Port (port)
ru: Порт
zh_hans: 端口 (port)

# TbRequestHost
source: Camouflage domain(host)
fr: Domaine de camouflage (host)
hu: Álcázási tartomány(host)
ru: Маскирующий домен (хост)
zh_hans: 伪装域名 (host)

# TbSecurity
source: Encryption method (security)
fa_ir: روش رمزگذاری (امنیتی)
fr: Méthode de chiffrement (security)
hu: Titkosítási módszer (biztonság)
ru: Метод шифрования
zh_hans: 加密方式 (security)

# TbStreamSecurity
source: TLS
fr: Sécurité couche transport (TLS)
zh_hans: 传输层安全 (TLS)

# TipNetwork
source: *Default value tcp
fa_ir: *مقدار پیش فرض tcp
fr: *tcp par défaut ; un mauvais choix empêchera la connexion
hu: *Alapértelmezett érték tcp
ru: *По-умолчанию TCP
zh_hans: *默认 tcp，选错会无法连接

# TbCoreType
source: Core Type
fa_ir: نوع هسته
fr: Type de Core
hu: Core Típus
ru: Ядро
zh_hans: Core 类型

# TbFlow5
source: Flow
fa_ir: جریان
fr: Contrôle de flux (flow)
ru: Поток
zh_hans: 流控 (flow)

# TbGUID
source: Generate
fa_ir: ساختن
fr: Générer
hu: Generálás
ru: Генерировать
zh_hans: 生成

# TbId3
source: Password
fa_ir: رمزعبور
fr: Mot de passe (password)
hu: Jelszó
ru: Пароль
zh_hans: 密码 (password)

# TbId4
source: Password(Optional)
fa_ir: رمز عبور (اختیاری)
fr: Mot de passe (optionnel)
hu: Jelszó(Opcionális)
ru: Пароль(Необязательно)
zh_hans: 密码 (可选)

# TbId5
source: UUID(id)
fr: ID utilisateur (id)
zh_hans: 用户 ID (id)

# TbSecurity3
source: Encryption
fa_ir: رمزگذاری
fr: Mode chiffrement (encryption)
hu: Titkosítás
ru: Шифрование
zh_hans: 加密方式 (encryption)

# TbSecurity4
source: User(Optional)
fa_ir: کاربر (اختیاری)
fr: Nom d’utilisateur (optionnel)
hu: Felhasználó(Opcionális)
ru: Пользователь(Необязательно)
zh_hans: 用户名 (可选)

# TbSecurity5
source: Encryption
fa_ir: رمزگذاری
fr: Mode chiffrement (encryption)
hu: Titkosítás
ru: Шифрования
zh_hans: 加密方式 (encryption)

# TbPreSocksPort
source: Socks port
fa_ir: txtPreSocksPort
fr: Port Socks
ru: Порт SOCKS
zh_hans: Socks 端口

# TipPreSocksPort
source: * After setting this value, a socks service will be started using Xray/sing-box(Tun) to provide functions such as speed display
fa_ir: * پس از تنظیم این مقدار، یک سرویس جوراب با استفاده از Xray/sing-box (Tun) برای ارائه عملکردهایی مانند نمایش سرعت شروع می شود.
fr: *Valeur du port Socks pour la configuration personnalisée (facultatif). Si défini, Xray/sing-box (Tun) démarrera un service Socks en amont supplémentaire pour fournir le routage sélectif et l’affichage de la vitesse.
hu: * A beállítás után egy socks szolgáltatás indul az Xray/sing-box(Tun) segítségével, hogy olyan funkciókat biztosítson, mint a sebességkijelzés
ru: * После установки этого значения служба SOCKS будет запущена с использованием Xray/sing-box(TUN) для обеспечения таких функций, как отображение скорости
zh_hans: *自定义配置的 Socks 端口值，可不设置；当设置此值后，将使用 Xray/sing-box (Tun) 额外启动一个前置 Socks 服务，提供分流和速度显示等功能

# TbBrowse
source: Browse
fa_ir: مرور کردن
fr: Parcourir
hu: Tallózás
ru: Просмотр
zh_hans: 浏览

# TbEdit
source: Edit
fa_ir: ویرایش
fr: Éditer
hu: Szerkesztés
ru: Редактировать
zh_hans: 编辑

# TbSettingsAdvancedProtocol
source: Advanced proxy settings, protocol selection (optional)
fa_ir: تنظیمات پیشرفته پروکسی، انتخاب پروتکل (اختیاری)
fr: Paramètres avancés du proxy, choix du protocole (optionnel)
hu: Haladó proxy beállítások, protokoll kiválasztása (opcionális)
ru: Расширенные настройки прокси, выбор протокола (необязательно)
zh_hans: 高级代理设置，协议选择 (可选)

# TbSettingsAllowLAN
source: Allow connections from the LAN
fa_ir: اتصالات از LAN را مجاز کنید
fr: Autoriser les connexions depuis le LAN
hu: Kapcsolatok engedélyezése a LAN-ról
ru: Разрешить подключения из локальной сети
zh_hans: 允许来自局域网的连接

# TbSettingsAutoHideStartup
source: Auto hide on startup
fa_ir: مخفی کردن خودکار هنگام راه اندازی
fr: Masquer la fenêtre au démarrage
hu: Automatikus elrejtés indításkor
ru: Автоскрытие при автозапуске
zh_hans: 启动后隐藏窗口

# TbSettingsAutoUpdateInterval
source: Automatic update interval for Geo files (hours)
fa_ir: فاصله به روز رسانی خودکار برای فایل های Geo (ساعت)
fr: Intervalle de mise à jour automatique des fichiers Geo (heures)
hu: Geo fájlok automatikus frissítési intervalluma (órák)
ru: Интервал автоматического обновления Geo в часах
zh_hans: 自动更新 Geo 文件的间隔 (小时)

# TbSettingsCore
source: Core: basic settings
fa_ir: هسته: تنظیمات اولیه
fr: Core : paramètres de base
hu: Core: alapbeállítások
ru: Ядро: базовые настройки
zh_hans: Core: 基础设置

# TbCustomDnsRay
source: V2ray Custom DNS
fr: DNS personnalisé v2ray

# TbSettingsCoreKcp
source: Core: KCP settings
fa_ir: هسته: تنظیمات KCP
fr: Core : paramètres KCP
hu: Core: KCP beállítások
ru: Ядро: настройки KCP
zh_hans: Core: KCP 设置

# TbSettingsCoreType
source: Core Type settings
fa_ir: تنظیمات CoreType
fr: Paramètres du type de Core
hu: Core Típus beállítások
ru: Настройки типа ядра
zh_hans: Core 类型设置

# TbSettingsDefAllowInsecure
source: Allow Insecure
fa_ir: اعطای مجوز ناامن
fr: Ignorer la vérif. du certificat (Dangereux)
hu: Nem biztonságos engedélyezése
ru: Разрешить небезопасные
zh_hans: 默认跳过证书验证 (allowInsecure)

# TbSettingsDomainStrategy4Freedom
source: Outbound Freedom domain Strategy
fr: domainStrategy de Freedom (sortant)
hu: Kimenő Freedom tartomány stratégia
ru: «Freedom»: стратегия обработки доменов исходящего трафика

# TbSettingsEnableAutoAdjustMainLvColWidth
source: Automatically adjust column width after subscription update
fa_ir: پس از به‌روزرسانی اشتراک، عرض ستون به صورت خودکار تنظیم شود
fr: Auto-ajuster la largeur des colonnes après maj. des abonnements
hu: Oszlopszélesség automatikus beállítása előfizetés frissítése után
ru: Автоматически регулировать ширину столбца после обновления подписки
zh_hans: 自动调整配置文件列宽在更新订阅后

# TbSettingsEnableCheckPreReleaseUpdate
source: Check for pre-release updates
fa_ir: به روز رسانی های پیش از انتشار را بررسی شود
fr: Vérifier les mises à jour pré-version (à activer avec prudence)
hu: Előzetes kiadás frissítések ellenőrzése
ru: Проверить наличие предварительных обновлений
zh_hans: 检查 Pre-Release 更新 (请谨慎启用)

# TbSettingsException
source: Exception
fa_ir: استثنا
fr: Exceptions
hu: Kivétel
ru: Исключение
zh_hans: 例外

# TbSettingsExceptionTip
source: Exclusions: Do not use proxy server for addresses beginning with the following. Use semicolon (;) to separate entries.
fa_ir: استثناها: از سرور پروکسی برای آدرس هایی که با موارد زیر شروع می شوند استفاده نکنید. برای جدا کردن ورودی ها از نقطه ویرگول (;) استفاده کنید.
fr: Exceptions : pour les adresses commençant par les caractères ci-dessous, ne pas utiliser le proxy. Séparez par des points-virgules (;).
hu: Kivételek: Ne használjon proxy szervert a következő címmel kezdődő címekhez. Pontosvesszővel (;) válassza el a bejegyzéseket.
ru: Исключение. Не используйте прокси-сервер для адресов, начинающихся с (,), используйте точку с запятой (;)
zh_hans: 例外：对于下列字符开头的地址，不使用代理配置文件。使用分号 (;) 分隔。

# TbSettingsDisplayRealTimeSpeed
source: Display real-time speed (requires restart)
fa_ir: نمایش سرعت واقعی (نیاز به راه اندازی مجدد)
fr: Afficher la vitesse en temps réel (redémarrage requis)
hu: Valós idejű sebesség megjelenítése (újraindítást igényel)
ru: Показывать скорость в реальном времени
zh_hans: 显示实时速度 (需重启)

# TbSettingsKeepOlderDedupl
source: Keep older entries when de-duplicating
fa_ir: ورودی‌های قدیمی‌تر را هنگام حذف کپی نگه دارید
fr: À la déduplication, garder l’élément au plus petit numéro
hu: Régebbi bejegyzések megtartása deduplikáláskor
ru: Сохранить старые при удалении дублей
zh_hans: 去重时保留序号较小的项

# TbSettingsLogEnabled
source: Enable Log
fa_ir: ثبت گزارش های محلی
fr: Activer les journaux
hu: Naplózás engedélyezése
ru: Записывать логи
zh_hans: 启用日志

# TbSettingsLogLevel
source: Log Level
fa_ir: سطح ثبت رویداد
fr: Niveau de journalisation
hu: Naplózási szint
ru: Уровень записи логов
zh_hans: 日志等级

# TbSettingsMuxEnabled
source: Turn on Mux Multiplexing
fa_ir: فعال کردن Mux Multiplexing
fr: Activer Mux multiplex
hu: Mux Multiplexing bekapcsolása
ru: Включить мультиплексирование Mux
zh_hans: 开启 Mux 多路复用

# TbSettingsN
source: v2rayN settings
fa_ir: تنظیمات v2rayN
fr: Paramètres v2rayN
hu: v2rayN beállítások
ru: Настройки v2rayN
zh_hans: v2rayN 设置

# TbSettingsPass
source: Auth pass
fa_ir: مجوز احراز هویت
fr: Mot de passe d’authentification
hu: Hitelesítési jelszó
ru: Пароль аутентификации
zh_hans: 认证密码

# TbSettingsRemoteDNS
source: Custom DNS (multiple, separated by commas (,))
fa_ir: سفارشی DNS (multiple, separated by commas (,))
fr: DNS personnalisés (plusieurs possibles, séparés par des virgules)
hu: Egyéni DNS (több, vesszővel (,) elválasztva)
ru: Пользовательский DNS (если несколько, то делите запятыми (,))
zh_hans: 自定义 DNS (可多个，用逗号 (,) 分隔)

# TbSettingsSetUWP
source: Set Win10 UWP Loopback
fa_ir: تنظیم کردن Win10 UWP Loopback
fr: Lever la restriction de proxy en boucle locale pour les applications Win10 UWP
hu: Win10 UWP Loopback beállítása
ru: Разрешить loopback для приложений UWP (Win10)
zh_hans: 解除 Win10 UWP 应用回环代理限制

# TbSettingsSniffingEnabled
source: Turn on Sniffing
fa_ir: فعال کردن Sniffing
fr: Activer le sniffing de trafic
hu: Sniffing bekapcsolása
ru: Включить сниффинг
zh_hans: 开启流量探测

# TbSettingsSocksPort
source: Mixed Port
fa_ir: پورت Mixed
fr: Port d’écoute mixte local
hu: Vegyes port
ru: Смешанный порт
zh_hans: 本地混合监听端口

# TbSettingsStartBoot
source: Start on boot
fa_ir: درهنگام راه ائدازی شروع شود
fr: Lancer au démarrage (peut échouer)
hu: Indítás rendszerindításkor
ru: Автозапуск
zh_hans: 开机启动 (可能会不成功)

# TbSettingsStatistics
source: Enable traffic statistics (requires restart)
fa_ir: فعال کردن آمار ترافیک (نیاز به راه اندازی مجدد)
fr: Activer les statistiques de trafic (redémarrage requis)
hu: Forgalmi statisztikák engedélyezése (újraindítást igényel)
ru: Включить статистику (требуется перезагрузка)
zh_hans: 启用流量统计 (需重启)

# TbSettingsSubConvert
source: Subscription conversion URL
fa_ir: آدرس اینترنتی تبدیل اشتراک
fr: URL de conversion d’abonnement (optionnel)
hu: Előfizetés konverziós URL
ru: URL конвертации подписок
zh_hans: 订阅转换网址 (可选)

# TbSettingsSystemproxy
source: System proxy settings
fa_ir: تنظیمات پراکسی سیستم
fr: Paramètres du proxy système
hu: Rendszerproxy beállítások
ru: Настройки системного прокси
zh_hans: 系统代理设置

# TbSettingsTrayMenuServersLimit
source: Tray right-click menu Configurations display limit
fa_ir: محدودیت نمایش سرورهای منوی سینی کلیک راست
fr: Limite du nombre de configurations affichées dans le menu du plateau
hu: Tálca jobb egérgombos menü konfigurációk megjelenítési limitje
ru: Лимит серверов в меню трея
zh_hans: 托盘右键菜单配置文件展示数量限制

# TbSettingsUdpEnabled
source: Enable UDP
fa_ir: فعال سازی UDP
fr: Activer l’UDP
hu: UDP engedélyezése
ru: Включить UDP
zh_hans: 开启 UDP

# TbSettingsUser
source: Auth user
fa_ir: تایید کاربر
fr: Nom d’utilisateur d’authentification
hu: Hitelesítési felhasználó
ru: Имя пользователя (логин)
zh_hans: 认证用户名

# TbClearSystemProxy
source: Clear system proxy
fa_ir: پاک کردن پروکسی سیستم
fr: Effacer le proxy système
hu: Rendszerproxy törlése
ru: Очистить системный прокси
zh_hans: 清除系统代理

# TbDisplayGUI
source: Display GUI
fa_ir: نمایش رابط کاربری گرافیکی
fr: Afficher l’interface principale
hu: GUI megjelenítése
ru: Показать GUI
zh_hans: 显示主界面

# TbGlobalHotkeySetting
source: Global Hotkey Settings
fa_ir: تنظیم کلید میانبر جهانی
fr: Paramètres des raccourcis globaux
hu: Globális gyorsbillentyű beállítások
ru: Настройка горячих клавиш
zh_hans: 全局热键设置

# TbGlobalHotkeySettingTip
source: Set directly by pressing the keyboard; takes effect after restart
fa_ir: مستقیماً با فشار دادن صفحه کلید تنظیم کنید. پس از راه اندازی مجدد اعمال می شود
fr: Appuyez directement sur les touches pour définir ; prendra effet après redémarrage
hu: Közvetlenül beállítható billentyűnyomással; újraindítás után lép életbe
ru: Установите непосредственно, нажав на клавиатуру, вступит в силу после перезапуска
zh_hans: 直接按键盘进行设置，重启后生效

# TbNotChangeSystemProxy
source: Do not change system proxy
fa_ir: پروکسی سیستم را تغییر ندهید
fr: Ne pas modifier le proxy système
hu: Ne változtassa meg a rendszerproxyt
ru: Не изменять системный прокси
zh_hans: 不改变系统代理

# TbReset
source: Reset
fa_ir: بازنشانی
fr: Réinitialiser
hu: Visszaállítás
ru: Обнулить
zh_hans: 重置

# TbSetSystemProxy
source: Set system proxy
fa_ir: تنظیم پراکسی سیستم
fr: Configurer automatiquement le proxy système
hu: Rendszerproxy beállítása
ru: Установить системный прокси
zh_hans: 自动配置系统代理

# TbSystemProxyPac
source: PAC mode
fa_ir: حالت Pac
fr: Mode PAC
hu: PAC mód
ru: Режим PAC
zh_hans: Pac 模式

# menuShareServer
source: Share Configuration (Ctrl+F)
fa_ir: اشتراک گذاری سرور(Ctrl+F)
fr: Partager (Ctrl+F)
hu: Konfiguráció megosztása (Ctrl+F)
ru: Поделиться сервером (Ctrl+F)
zh_hans: 分享配置文件 (Ctrl+F)

# menuRouting
source: Routing
fa_ir: مسیریابی
fr: Routage
hu: Útválasztás
ru: Маршрутизация
zh_hans: 路由

source: Not run as Admin
fa_ir: به عنوان ادمین اجرا نمی شود
fr: Exécuter sans droits administrateur
hu: Nem rendszergazdaként fut
ru: Пользователь
zh_hans: 以非管理员身份运行

source: Run as Admin
fa_ir: اجرا به عنوان ادمین
fr: Exécuter en tant qu’administrateur
hu: Futtatás rendszergazdaként
ru: Администратор
zh_hans: 以管理员身份运行

# menuMoveBottom
source: Move to bottom (B)
fa_ir: به پایین حرکت شود(B)
fr: Déplacer tout en bas (B)
hu: Mozgatás alulra (B)
ru: Спуститься вниз (B)
zh_hans: 下移至底 (B)

# menuMoveDown
source: Down (D)
fa_ir: پایین
fr: Descendre (D)
hu: Le (D)
ru: Вниз (D)
zh_hans: 下移 (D)

# menuMoveTop
source: Move to top (T)
fa_ir: حرکت به بالا
fr: Déplacer tout en haut (T)
hu: Mozgatás felülre (T)
ru: Подняться наверх (T)
zh_hans: 上移至顶 (T)

# menuMoveUp
source: Up (U)
fa_ir: بالا
fr: Monter (U)
hu: Fel (U)
ru: Вверх (U)
zh_hans: 上移 (U)

# MsgFilterTitle
source: Filter, supports regular expressions
fa_ir: فیلتر، از عبارات منظم پشتیبانی می کند
fr: Filtre (regex pris en charge)
hu: Szűrő, támogatja a reguláris kifejezéseket
ru: Фильтр, поддерживает regex
zh_hans: 过滤器 (支持正则)

# menuWebsiteItem
source: {0} Website
fa_ir: {0} وب سایت
fr: Site officiel de {0}
hu: {0} Weboldal
ru: {0} веб-сайт
zh_hans: {0} 官网

# menuRoutingAdvancedAdd
source: Add
fa_ir: اضافه کردن
fr: Ajouter un jeu de règles
hu: Hozzáadás
ru: Добавить
zh_hans: 添加规则集

# menuRoutingAdvancedImportRules
source: Import Rules
fa_ir: وارد کردن مجموعه قوانین
fr: Importer 1-clic du jeu de règles
hu: Szabályok importálása
ru: Добавить расширенные правила
zh_hans: 一键导入规则集

# menuRoutingAdvancedRemove
source: Remove selected (Delete)
fa_ir: حذف انتخاب شده
fr: Supprimer les règles sélectionnées (Delete)
hu: Kijelölt eltávolítása (Delete)
ru: Удалить выбранные
zh_hans: 移除所选规则 (Delete)

# menuRoutingAdvancedSetDefault
source: Set as active rule (Enter)
fa_ir: تنظیم کردن به عنوان قانون فعال
fr: Définir comme règles actives (Entrée)
hu: Beállítás aktív szabályként (Enter)
ru: Установить как активное правило
zh_hans: 设为活动规则 (Enter)

# TbdomainStrategy
source: Domain strategy
fa_ir: استراتژی دامنه
fr: Stratégie résolution domaine
hu: Tartomány stratégia
ru: Доменная стратегия
zh_hans: 域名解析策略

# TbRoutingTabRuleList
source: Pre-defined Rule Set List
fa_ir: لیست مجموعه قوانین از پیش تعریف شده
fr: Liste des jeux de règles prédéfinis
hu: Előre definiált szabálykészlet lista
ru: Предустановленный список наборов правил
zh_hans: 预定义规则集列表
