Repository: 2dust/v2rayN
Catalog: v2rayN/ServiceLib/Resx/ResUI.*.resx
Languages: fa_ir, fr, hu, ru, zh_hans

# TbRoutingTips
source: *Separate rules by commas (,); For a literal comma use <COMMA>; Prefix # to ignore a rule
fa_ir: *قوانین را با کاما (,) جدا کنید. برای کاما به معنای واقعی کلمه از <COMMA>; پیشوند # برای نادیده گرفتن یک قانون
fr: *Règles de routage définies, séparées par des virgules (,); remplacez la virgule dans les expressions régulières par <COMMA>
hu: *Szabályok elválasztása vesszővel (,); Szó szerinti vesszőhöz használja a <COMMA>-t; Előtag # a szabály figyelmen kívül hagyásához
ru: *Разделяйте правила запятыми (,). Литерал «,» — <COMMA>. Префикс # — отключить правило
zh_hans: *设置的路由规则，用逗号 (,) 分隔；正则中的逗号用 <COMMA> 替代

# menuImportRulesFromClipboard
source: Import Rules From Clipboard
fa_ir: وارد کردن قوانین از کلیپ بورد
fr: Importer règles du presse-papiers
hu: Szabályok importálása vágólapról
ru: Импорт правил из буфера обмена
zh_hans: 从剪贴板中导入规则

# menuImportRulesFromFile
source: Import Rules From File
fa_ir: وارد کردن قوانین از فایل
fr: Importer règles depuis fichier
hu: Szabályok importálása fájlból
ru: Импорт правил из файла
zh_hans: 从文件中导入规则

# menuImportRulesFromUrl
source: Import Rules From Subscription URL
fa_ir: وارد کردن قوانین از آدرس اینترنتی Sub
fr: Importer depuis URL d’abonnement
hu: Szabályok importálása előfizetési URL-ből
ru: Импорт правил из URL
zh_hans: 从订阅 Url 中导入规则

# menuRoutingRuleSetting
source: Rule Settings
fa_ir: تنظیم قانون
fr: Paramètres du jeu de règles
hu: Szabály beállítások
ru: Настройка правил
zh_hans: 规则集设置

# menuRuleAdd
source: Add Rule
fa_ir: اضافه کردن قانون
fr: Ajouter une règle
hu: Szabály hozzáadása
ru: Добавить правило
zh_hans: 添加规则

# menuRuleExportSelected
source: Export Selected Rules
fa_ir: صادر کردن قوانین انتخاب شده
fr: Exporter les règles sélectionnées vers le presse-papiers
hu: Kijelölt szabályok exportálása
ru: Экспорт выделенных правил
zh_hans: 导出所选规则至剪贴板

# menuRuleList
source: Rule List
fa_ir: فهرست قوانین
fr: Liste des règles
hu: Szabálylista
ru: Список правил
zh_hans: 规则列表

# menuRuleRemove
source: Remove Rule (Delete)
fa_ir: حذف قوانین
fr: Supprimer les règles sélectionnées (Delete)
hu: Szabály eltávolítása (Delete)
ru: Удалить правила (Delete)
zh_hans: 移除所选规则 (Delete)

# menuRoutingRuleDetailsSetting
source: Routing Rule Details Setting
fa_ir: تنظیم جزئیات قانون مسیریابی
fr: Paramètres détaillés des règles de routage
hu: Útválasztási szabály részleteinek beállítása
ru: Детальные настройки правил маршрутизации
zh_hans: 路由规则详情设置

# TbAutoSort
source: Domain, IP, process are auto-sorted when saving
fa_ir: دامنه و آی پی در هنگام ذخیره به طور خودکار مرتب می شوند
fr: Tri automatique par domaine, IP et nom de processus lors de l’enregistrement
hu: Tartomány, IP, folyamat automatikusan rendeződik mentéskor
ru: Домен и IP автоматически сортируются при сохранении
zh_hans: 保存时 Domain, IP, 进程名 自动排序

# TbRuleobjectDoc
source: Rule object Doc
fa_ir: مستندات شی قانون
fr: Documentation détaillée des règles
hu: Szabály objektum dokumentum
ru: Документация RuleObject
zh_hans: 规则详细说明文档

# TbDnsObjectDoc
source: Supports DNS Object; Click to view documentation
fa_ir: پشتیبانی از DnsObject. برای مشاهده مستندات کلیک کنید
fr: Saisie de DnsObject prise en charge (format JSON), cliquer pour voir la documentation
hu: Támogatja a DNS objektumot; Kattintson a dokumentáció megtekintéséhez
ru: Поддерживаются DNS-объекты, нажмите для просмотра документации
zh_hans: 支持填写 DnsObject，JSON 格式，点击查看文档

# SubUrlTips
source: For group please leave blank here
fa_ir: گروه لطفا اینجا را خالی بگذارید
fr: Laissez vide pour les groupes ordinaires
hu: Csoport esetén hagyja üresen
ru: Необязательное поле
zh_hans: 普通分组此处请留空

# TipChangeRouting
source: Routing setting has changed
fa_ir: تنظیمات مسیریابی تغییر کرده است
fr: Paramètres de routage modifiés
hu: Útválasztási beállítás megváltozott
ru: Настройки маршрутизации изменены
zh_hans: 路由设置改变

# TipChangeSystemProxy
source: System proxy setting has changed
fa_ir: تنظیمات پراکسی سیستم تغییر کرده است
fr: Paramètres du proxy système modifiés
hu: Rendszerproxy beállítás megváltozott
ru: Системные прокси изменены
zh_hans: 系统代理设置改变

# TbSettingsRouteOnly
source: Route Only
fa_ir: فقط مسیر
fr: Routage uniquement (routeOnly)
hu: Csak útválasztás
ru: Только маршрут
zh_hans: 仅限路由 (routeOnly)

# TbSettingsNotProxyLocalAddress
source: Do not use proxy servers for local (intranet) addresses
fa_ir: از سرورهای پروکسی برای آدرس های محلی (اینترانت) استفاده نکنید
fr: Ne pas utiliser le proxy pour les adresses locales (Intranet)
hu: Ne használjon proxy szervert helyi (intranet) címekhez
ru: Не используйте прокси-серверы для локальных (интранет) адресов
zh_hans: 请勿将代理服务器用于本地 (Intranet) 地址

# menuMixedTestServer
source: One-click multi-test latency and speed (Ctrl+E)
fa_ir: تاخیر و سرعت تست با یک کلیک (Ctrl+E)
fr: Tester latence et vitesse multithread en un clic (Ctrl+E)
hu: Egykattintásos többszörös késleltetés és sebesség teszt (Ctrl+E)
ru: Тест задержки и скорости всех серверов (Ctrl+E)
zh_hans: 一键多线程测试延迟和速度 (Ctrl+E)

# LvTestDelay
source: Delay (ms)
fa_ir: تاخیر (میلی‌ثانیه)
fr: Latence (ms)
hu: Késleltetés (ms)
ru: Задержка (мс)
zh_hans: 延迟 (ms)

# LvTestSpeed
source: Speed (MB/s)
fa_ir: سرعت (MB/s)
fr: Vitesse (Mo/s)
hu: Sebesség (M/s)
ru: Скорость (МБ/с)
zh_hans: 速度 (M/s)

# FailedToRunCore
source: Failed to run Core, please check the prompt information
fa_ir: Core اجرا نشد، لطفاً گزارش را ببینید
fr: Échec d’exécution du Core, veuillez consulter les messages
hu: Nem sikerült futtatni a Core-t, kérjük, ellenőrizze a prompt információt
ru: Не удалось запустить ядро, посмотрите логи
zh_hans: 运行 Core 失败，请查看提示信息

# LvFilter
source: Remarks regular filter
fr: Filtrage par alias (regex)
hu: Megjegyzések reguláris szűrője
ru: Фильтр примечаний (Regex)
zh_hans: 别名正则过滤

# TbDisplayLog
source: Display Log
fa_ir: نمایش گزارش
fr: Afficher les journaux
hu: Napló megjelenítése
ru: Показать логи
zh_hans: 显示日志

# TbEnableTunAs
source: Enable Tun
fa_ir: فعال سازی Tun
fr: Activer Tun
hu: Tun engedélyezése
ru: Режим VPN
zh_hans: 启用 Tun

# TbSettingsNewPort4LAN
source: New Port for LAN
fa_ir: پورت جدید برای LAN
fr: Ouvrir un nouveau port pour le LAN
hu: Új port a LAN-hoz
ru: Новый порт для локальной сети
zh_hans: 为局域网开启新的端口

# TbSettingsTunMode
source: Tun Mode settings
fa_ir: تنظیمات TunMode
fr: Paramètres du mode Tun
hu: Tun mód beállítások
ru: Настройки режима TUN
zh_hans: Tun 模式设置

# menuMoveToGroup
source: Move to group
fa_ir: انتقال به گروه
fr: Déplacer vers un groupe d’abonnement
hu: Mozgatás csoportba
ru: Перейти в группу
zh_hans: 移至订阅分组

# TbSettingsEnableDragDropSort
source: Enable sorting Configurations by drag-n-drop (requires restart)
fa_ir: فعال کردن مرتب‌سازی سرورها با کشیدن و رها کردن (نیاز به راه‌اندازی مجدد)
fr: Activer le tri par glisser-déposer des configurations (redémarrage requis)
hu: Konfigurációk rendezésének engedélyezése húzással (újraindítást igényel)
ru: Включить сортировку перетаскиванием сервера (требуется перезагрузка)
zh_hans: 启用配置文件拖放排序 (需重启)

# TbAutoRefresh
source: Auto refresh
fa_ir: بازخوانی خودکار
fr: Actualisation automatique
hu: Automatikus frissítés
ru: Автообновление
zh_hans: 自动刷新

# SpeedtestingSkip
source: Skip test
fa_ir: رد شدن از آزمون
fr: Ignorer le test
hu: Teszt kihagyása
ru: Пропустить тест
zh_hans: 跳过测试

# menuEditServer
source: Edit Configuration (Ctrl+D)
fa_ir: ویرایش سرور
fr: Éditer (Ctrl+D)
hu: Konfiguráció szerkesztése (Ctrl+D)
ru: Редактировать сервер (Ctrl+D)
zh_hans: 编辑配置文件 (Ctrl+D)

# TbSettingsDoubleClick2Activate
source: Double-clicking Configuration makes it active
fa_ir: دوبار کلیک کردن سرور باعث فعال شدن آن می شود
fr: Double-cliquer sur l’interface principale pour activer
hu: Dupla kattintás a konfigurációra aktiválja
ru: Двойной клик чтобы сделать сервер активным
zh_hans: 主界面双击设为活动配置文件

# SpeedtestingCompleted
source: Test completed
fa_ir: تست تکمیل شد
fr: Test terminé
hu: Teszt befejeződött
ru: Тест завершен
zh_hans: 测试完成

# TbSettingsDefFingerprint
source: Default TLS fingerprint
fa_ir: اثر انگشت tls پیش فرض
fr: Empreinte TLS par défaut (fingerprint)
hu: Alapértelmezett TLS ujjlenyomat
ru: TLS отпечаток по умолчанию
zh_hans: 默认 TLS 指纹 (fingerprint)

# TbSettingsDefUserAgent
source: User-Agent
fr: Agent utilisateur (User-Agent)
zh_hans: 用户代理 (User-Agent)

# TbSettingsDefUserAgentTips
source: This parameter is valid only for tcp/http and ws
fa_ir: این پارامتر فقط برای tcp/http و ws معتبر است
fr: Valable uniquement pour les protocoles tcp/http et ws
hu: Ez a paraméter csak tcp/http és ws esetén érvényes
ru: Параметр действует только для TCP/HTTP и WebSocket (WS)
zh_hans: 仅对 tcp/http、ws 协议生效

# TbSettingsCurrentFontFamily
source: Font family (requires restart)
fa_ir: FontFamily (نیاز به راه اندازی مجدد)
fr: Police actuelle (redémarrage requis)
hu: Betűtípus (újraindítást igényel)
ru: Шрифт (требуется перезагрузка)
zh_hans: 当前字体 (需重启)

# TbSettingsCurrentFontFamilyTip
source: Copy the font TTF/TTC file to the directory gui Fonts; Reopen the settings window
fa_ir: فایل TTF/TTC فونت را در دایرکتوری guiFonts کپی کنید. پنجره تنظیمات را دوباره باز کنید
fr: Copiez les fichiers de police TTF/TTC dans le dossier guiFonts, effet après redémarrage
hu: Másolja a TTF/TTC betűtípus fájlt a gui Fonts könyvtárba; Nyissa meg újra a beállítások ablakot
ru: Скопируйте файл шрифта TTF/TTC в каталог guiFonts и заново откройте окно настроек
zh_hans: 拷贝字体 TTF/TTC 文件到目录 guiFonts，重启生效

# TbSettingsSocksPortTip
source: Pac port = +3; Xray API port = +4; mihomo API port = +5;
fa_ir: پورت Pac = +3; پورت Xray API = +4; پورت mihomo API = +5;
fr: Port PAC = +3 ; port API Xray = +4 ; port API mihomo = +5 ;
ru: Pac порт = +3,Xray API порт = +4, mihomo API порт = +5
zh_hans: Pac 端口 = +3；Xray API 端口 = +4；mihomo API 端口 = +5；

# TbSettingsStartBootTip
source: Set this with admin privileges, get admin privileges after startup
fa_ir: این را با امتیازات ادمین تنظیم کنید، پس از راه اندازی، امتیازات مدیر را دریافت کنید
fr: Définir cette option avec des privilèges administrateur pour obtenir les droits admin au démarrage
hu: Rendszergazdai jogosultságokkal állítsa be, indítás után szerezzen rendszergazdai jogosultságokat
ru: Установите это с правами администратора
zh_hans: 以管理员权限设置此项，在启动后获得管理员权限

# TbSettingsFontSize
source: Font Size
fa_ir: اندازه فونت
fr: Taille de police
hu: Betűméret
ru: Размер шрифта
zh_hans: 字体大小

# TbSettingsSpeedTestTimeout
source: Speed Test Single Timeout Value
fa_ir: یمقدار تاخیر تست سرعت منفرد
fr: Délai d’expiration du test de vitesse (unitaire)
hu: Sebességteszt egyszeri időtúllépési érték
ru: Тайм-аут одиночного тестирования скорости
zh_hans: 测速单个超时值

# TbSettingsSpeedTestUrl
source: Speed Test URL
fa_ir: /آدرس اینترنتی SpeedTest
fr: URL du fichier de test de vitesse
hu: Sebességteszt URL
ru: URL для тестирования скорости
zh_hans: 测速文件地址

# menuMoveTo
source: Move up and down
fa_ir: بالا و پایین حرکت کنید
fr: Déplacer vers haut/bas
hu: Mozgatás fel és le
ru: Переместить вверх/вниз
zh_hans: 移至上下

# TbSettingsEnableHWA
source: Enable hardware acceleration (requires restart)
fa_ir: فعال‌ سازی شتاب‌ دهنده سخت‌ افزاری (نیاز به راه‌اندازی مجدد)
fr: Activer l’accélération matérielle (redémarrage requis)
hu: Hardveres gyorsítás engedélyezése (újraindítást igényel)
ru: Включить аппаратное ускорение (требуется перезагрузка)
zh_hans: 启用硬件加速 (需重启)

# SpeedtestingWait
source: Waiting for testing (press ESC to terminate)...
fa_ir: در انتظار آزمایش...
fr: En attente du test (appuyer sur Échap pour arrêter)...
hu: Tesztelésre vár (ESC megnyomásával megszakítható)...
ru: Ожидание тестирования (нажмите ESC для отмены)…
zh_hans: 等待测试中 (按 ESC 终止)...

# TipDisplayLog
source: Please turn off when there is an abnormal disconnection
fa_ir: لطفاً در صورت قطع غیرعادی آن را خاموش کنید
fr: Désactivez ceci en cas de coupures anormales
hu: Kérjük, kapcsolja ki rendellenes megszakadás esetén
ru: Отключите при аномальном разрыве соединения
zh_hans: 当有异常断流时请关闭

# MsgSkipSubscriptionUpdate
source: Updates are not enabled, skip this subscription
fa_ir: به روز رسانی ها فعال نیستند، از این اشتراک رد شوید
fr: Mise à jour désactivée, abonnement ignoré
hu: A frissítések nincsenek engedélyezve, kihagyja ezt az előfizetést
ru: Обновления не включены — подписка пропущена
zh_hans: 未启用更新，跳过此订阅

# menuRebootAsAdmin
source: Restart as Administrator
fa_ir: به عنوان مدیر راه اندازی مجدد
fr: Redémarrer en tant qu’administrateur
hu: Újraindítás rendszergazdaként
ru: Перезагрузить как администратор
zh_hans: 以管理员身份重启

# LvMoreUrl
source: More URLs, separated by commas; Subscription conversion will be invalid
fa_ir: نشانی‌های وب بیشتر که با کاما از هم جدا شده‌اند. تبدیل اشتراک نامعتبر خواهد بود
fr: Adresses suppl. (URL), séparées par des virgules ; la conversion d’abonnement sera désactivée
hu: További URL-ek, vesszővel elválasztva; Az előfizetés konverzió érvénytelen lesz
ru: Дополнительные URL через запятую, конвертация подписки недоступна
zh_hans: 更多地址 (url)，用逗号 (,) 分隔；订阅转换将失效

# LvAutoUpdateInterval
source: Automatic update interval (minutes)
fa_ir: فاصله به روز رسانی خودکار (دقیقه)
fr: Intervalle maj. auto (min)
hu: Automatikus frissítési intervallum (percek)
ru: Интервал автоматического обновления в минутах
zh_hans: 自动更新间隔 (分钟)

# TbSettingsLogEnabledToFile
source: Enable logging to file
fa_ir: فعال کردن ورود به فایل
fr: Activer l’enregistrement des journaux dans un fichier
hu: Naplózás engedélyezése fájlba
ru: Включить запись логов в файл
zh_hans: 启用日志存到文件

# LvConvertTarget
source: Convert target type
fa_ir: تبدیل نوع هدف
fr: Type cible conv. d’abonnement
hu: Konverziós cél típus
ru: Преобразовать тип цели
zh_hans: 订阅转换目标类型

# LvConvertTargetTip
source: Please leave blank if no conversion is required
fa_ir: اگر نیازی به تبدیل نیست، لطفاً خالی بگذارید
fr: Laisser vide si aucune conversion n’est nécessaire
hu: Kérjük, hagyja üresen, ha nincs szükség konverzióra
ru: Если преобразование не требуется, оставьте поле пустым
zh_hans: 不需要转换时请留空

# menuDNSSetting
source: DNS Settings
fa_ir: تنظیمات DNS
fr: Paramètres DNS
hu: DNS beállítások
ru: Настройки DNS
zh_hans: DNS 设置

# TbCustomDnsSingbox
source: sing-box Custom DNS
fr: DNS personnalisé sing-box

# TbDnsSingboxObjectDoc
source: Please fill in DNS Structure, Click to view the document
fa_ir: لطفا ساختار DNS را پر کنید، برای مشاهده سند کلیک کنید
fr: Veuillez renseigner la structure JSON DNS ; cliquer pour voir la documentation
hu: Kérjük, töltse ki a DNS struktúrát, kattintson a dokumentum megtekintéséhez
ru: Заполните структуру DNS, нажмите, чтобы открыть документ
zh_hans: 请填写 DNS JSON 结构，点击查看文档

# TbSettingDnsImportDefConfig
source: Click to import default DNS config
fa_ir: برای وارد کردن تنظیمات پیش‌فرض DNS کلیک کنید
fr: Cliquez pour importer la configuration DNS par défaut
hu: Kattintson az alapértelmezett DNS konfiguráció importálásához
ru: Нажмите, чтобы импортировать конфигурацию DNS по умолчанию
zh_hans: 点击导入默认 DNS 配置

# TbdomainStrategy4Singbox
source: sing-box domain strategy
fa_ir: استراتژی دامنه sing-box
fr: Stratégie résolution domaine (sing-box)
hu: sing-box tartomány stratégia
ru: Стратегия домена для sing-box
zh_hans: sing-box 域名解析策略

# TbSettingsMux4SboxProtocol
source: sing-box Mux Protocol
fa_ir: پروتکل sing-box Mux
fr: Protocole de multiplexage Mux (sing-box)
hu: sing-box Mux protokoll
ru: Протокол Mux для sing-box
zh_hans: sing-box Mux 多路复用协议

# TbRoutingRuleProcess
source: Full process name (Tun mode)
fa_ir: Process (Tun mode)
fr: Nom complet du processus (mode Tun)
hu: Teljes folyamatnév (Tun mód)
ru: Полное имя процесса (режим TUN)
zh_hans: 进程名全称 (Tun 模式)

# TbRoutingRuleIP
source: IP or IP CIDR
fr: IP ou IP CIDR
hu: IP vagy IP CIDR
ru: IP-адрес или сеть CIDR
zh_hans: IP 或 IP CIDR

# TbRoutingRuleDomain
source: Domain
fa_ir: دامنه
fr: Domaine
hu: Tartomány
ru: Домен

# menuAddHysteria2Server
source: Add [Hysteria2] Configuration
fa_ir: Add [Hysteria2] server
fr: Ajouter [Hysteria2]
hu: Hysteria2 konfiguráció hozzáadása
ru: Добавить сервер [Hysteria2]
zh_hans: 添加 [Hysteria2] 配置文件

# TbSettingsHysteriaBandwidth
source: Hysteria Max bandwidth (Up/Down)
fa_ir: حداکتر پهنای باند هیستریا (آپلود/دانلود)
fr: Bande passante maximale Hysteria (Up/Down)
hu: Hysteria Max sávszélesség (Fel/Le)
ru: Максимальная пропускная способность Hysteria (загрузка/отдача)
zh_hans: Hysteria 最大带宽 (Up/Dw)

# TbSettingsUseSystemHosts
source: Use System Hosts
fa_ir: استفاده کردن از System Hosts
fr: Utiliser les hosts du système
hu: Rendszer Hosts használata
ru: Использовать системные узлы
zh_hans: 使用系统 hosts

# menuAddTuicServer
source: Add [TUIC] Configuration
fa_ir: افزودن سرور [TUIC]
fr: Ajouter [TUIC]
hu: TUIC konfiguráció hozzáadása
ru: Добавить сервер [TUIC]
zh_hans: 添加 [TUIC] 配置文件

# TbHeaderType8
source: Congestion control
fa_ir: کنترل تراکم
fr: Algo contrôle congestion
hu: Torlódásvezérlés
ru: Контроль перегрузок
zh_hans: 拥塞控制算法

# LvPrevProfile
source: Previous proxy Configuration remarks
fa_ir: نام مستعار پروکسی قبلی
fr: Alias de configuration du proxy amont
hu: Előző proxy konfiguráció megjegyzései
ru: Примечания к предыдущему прокси
zh_hans: 前置代理配置文件别名

# LvNextProfile
source: Next proxy Configuration remarks
fa_ir: نام مستعار پروکسی بعدی
fr: Alias de configuration du proxy aval
hu: Következő proxy konfiguráció megjegyzései
ru: Примечания к следующему прокси
zh_hans: 落地代理配置文件別名

# LvPrevProfileTip
source: Please make sure the Configuration remarks exist and are unique
fa_ir: لطفاً مطمئن شوید که ملاحظات وجود دارند و منحصر به فرد هستند
fr: Assurez-vous que l’alias config existe et est unique
hu: Kérjük, győződjön meg arról, hogy a konfigurációs megjegyzések léteznek és egyediek
ru: Убедитесь, что примечание существует и является уникальным
zh_hans: 请确保配置文件别名存在并唯一

# TbSettingsTunAutoRoute
source: Auto Route
fa_ir: مسیریابی خودکار
fr: Routage automatique
hu: Automatikus útválasztás
zh_hans: 自动路由

# TbSettingsTunStrictRoute
source: Strict Route
fa_ir: مسیریابی سخت‌گیرانه
fr: Routage strict
hu: Szigorú útválasztás
zh_hans: 严格路由

# TbSettingsTunStack
source: Stack
fa_ir: پشته شبکه
fr: Pile de protocoles
hu: Hálózati verem
zh_hans: 协议栈

# TbSettingsEnableExInbound
source: Enable additional Inbound
fa_ir: فعال سازی additional Inbound
fr: Activer un port d’écoute supplémentaire
hu: További bejövő engedélyezése
ru: Включить дополнительный входящий канал
zh_hans: 启用额外监听端口

# TbSettingsEnableIPv6Address
source: Enable IPv6 Address
fa_ir: فعال سازی آدرس IPv6
fr: Activer IPv6
hu: IPv6 cím engedélyezése
ru: Включить IPv6 адреса
zh_hans: 启用 IPv6

# menuAddWireguardServer
source: Add [WireGuard] Configuration
fa_ir: افزودن سرور [WireGuard]
fr: Ajouter [WireGuard]
hu: WireGuard konfiguráció hozzáadása
ru: Добавить сервер [WireGuard]
zh_hans: 添加 [WireGuard] 配置文件

# TbPath7
source: obfs password
fa_ir: پسورد obfs
fr: Mot de passe d’obfuscation (obfs password)
hu: obfs jelszó
ru: Пароль obfs
zh_hans: 混淆密码 (obfs password)

# TbRuleMatchingTips
source: (Domain or IP or Proc Name) and Port and Protocol and Inbound Tag => Outbound Tag
fr: (Domaine ou IP ou nom de processus) avec Port et Protocole et InboundTag => OutboundTag
hu: (Tartomány vagy IP vagy folyamatnév) és port és protokoll és bejövő címke => kimenő címke
ru: (Домен или IP или имя процесса) и порт, и протокол, и InboundTag => OutboundTag
zh_hans: (Domain 或 IP 或 进程名) 与 Port 与 Protocol 与 InboundTag => OutboundTag

# TbAutoScrollToEnd
source: Auto scroll to end
fa_ir: خودکار ScrollToEnd
fr: Défilement automatique vers la fin
hu: Automatikus görgetés a végére
ru: Автоматическая прокрутка в конец
zh_hans: 自动滚动到末尾

# TbSettingsSpeedPingTestUrl
source: Speed Ping Test URL
fa_ir: آدرس اینترنتی تست پینگ سرعت
fr: Adresse de test de connexion réelle
hu: Sebesség Ping Teszt URL
ru: URL для быстрой проверки реальной задержки
zh_hans: 真连接测试地址

# TbSettingsEnableUpdateSubOnlyRemarksExist
source: Updating subscription, only determining if remarks exist
fa_ir: اشتراک در حال به‌روزرسانی، فقط مشخص کنید که ملاحظاتی آیا وجود دارد!
fr: Ne vérifier l’existence de l’alias qu’à la maj. des abonnements
hu: Előfizetés frissítése, csak a megjegyzések létezésének ellenőrzése
ru: Обновляя подписку, проверять лишь наличие примечаний
zh_hans: 更新订阅时只判断别名已存在否

# SpeedtestingStop
source: Test terminating...
fa_ir: پایان تست...
fr: Arrêt du test en cours...
hu: Teszt megszakítása...
ru: Отмена тестирования...
zh_hans: 测试终止中...

# TransportRequestHostTip5
source: *grpc Authority
fr: *Autorité gRPC

# menuAddHttpServer
source: Add [HTTP] Configuration
fa_ir: افزودن سرور [HTTP]
fr: Ajouter [HTTP]
hu: HTTP konfiguráció hozzáadása
ru: Добавить сервер [HTTP]
zh_hans: 添加 [HTTP] 配置文件

# TbSettingsEnableFragmentTips
source: which conflicts with the group previous proxy
fr: En conflit avec le proxy amont de groupe
ru: Используйте Xray и отключите режим TUN, так как он конфликтует с предыдущим прокси-сервером группы
zh_hans: 和分组前置代理冲突

# TbSettingsEnableFragment
source: Enable fragment
fa_ir: فعال کردن فرگمنت
fr: Activer le fragmentation (Fragment)
hu: Fragment engedélyezése
ru: Включить фрагментацию (Fragment)
zh_hans: 启用分片 (Fragment)

# TbSettingsEnableCacheFile4Sbox
source: Enable cache file for sing-box (ruleset files)
fa_ir: فعال کردن کش فایل مجموعه قوانین برای sing-box
fr: Activer le fichier de cache de sing-box (fichiers de reˋgles)
hu: Gyorsítótár fájl engedélyezése sing-boxhoz (szabálykészlet fájlok)
ru: Включить файл кэша для sing-box (файлы наборов правил)
zh_hans: 启用 sing-box (规则集文件) 的缓存文件

# LvCustomRulesetPath4Singbox
source: Customize the rule-set of sing-box
fa_ir: سفارش سازی مجموعه قوانین sing box
fr: Set de règles sing-box perso
hu: A sing-box szabálykészletének testreszabása
ru: Пользовательский набор правил для sing-box
zh_hans: 自定义 sing-box rule-set

# NeedRebootTips
source: Successful operation. Click the settings menu to reboot the app.
fa_ir: عملکرد موفقیت آمیز بود، روی منوی تنظیمات کلیک کنید تا برنامه راه اندازی مجدد شود.
fr: Opération réussie. Veuillez redémarrer l’app via le menu Paramètres.
hu: Sikeres művelet. Kattintson a beállítások menüre az alkalmazás újraindításához.
ru: Операция успешна. Перезапустите приложение
zh_hans: 操作成功。请点击设置菜单重启应用。

# menuOpenTheFileLocation
source: Open the storage location
fa_ir: باز کردن محل ذخیره سازی
fr: Ouvrir l’emplacement du fichier
hu: Fájl helyének megnyitása
ru: Открыть место хранения
zh_hans: 打开存储所在的位置

# TbSorting
source: Sorting
fa_ir: مرتب سازی
fr: Tri
hu: Rendezés
ru: Сортировка
zh_hans: 排序

# TbSortingChain
source: Chain
fr: Chaîne de routage
hu: Lánc
ru: Цепочка
zh_hans: 路由链

# TbSortingDefault
source: Default
fa_ir: پیش فرض
fr: Par défaut
hu: Alapértelmezett
ru: По умолчанию
zh_hans: 默认

# TbSortingDelay
source: Delay
fa_ir: تاخیر
fr: Latence
hu: Késleltetés
ru: Задержка
zh_hans: 延迟

# TbSortingDownSpeed
source: Download Speed
fa_ir: سرعت دانلود
fr: Vitesse de téléchargement
hu: Letöltési sebesség
ru: Скорость загрузки
zh_hans: 下载速度

# TbSortingDownTraffic
source: Download Traffic
fa_ir: ترافیک دانلود
fr: Trafic téléchargé
hu: Letöltési forgalom
ru: Скачанный трафик
zh_hans: 下载流量

# TbSortingHost
source: Host
fa_ir: هاست
fr: Hôte
ru: Узел
zh_hans: 主机

# TbSortingName
source: Name
fa_ir: نام
fr: Nom
hu: Név
ru: Имя
zh_hans: 名称

# TbSortingNetwork
source: Network
fa_ir: شبکه
fr: Réseau
hu: Hálózat
ru: Сеть
zh_hans: 网络

# TbSortingTime
source: Time
fa_ir: زمان
fr: Heure
hu: Idő
ru: Время
zh_hans: 时间

# TbSortingUpSpeed
source: Upload Speed
fa_ir: سرعت اپلود
fr: Vitesse d’envoi
hu: Feltöltési sebesség
ru: Скорость отдачи
zh_hans: 上传速度

# TbSortingUpTraffic
source: Upload Traffic
fa_ir: ترافیک آپلود
fr: Trafic envoyé
hu: Feltöltési forgalom
ru: Отправленный трафик
zh_hans: 上传流量

# TbConnections
source: Connections
fa_ir: اتصالات
fr: Connexions en cours
hu: Kapcsolatok
ru: Соединения
zh_hans: 当前连接

# menuConnectionClose
source: Close Connection
fa_ir: بستن اتصال
fr: Fermer la connexion
hu: Kapcsolat bezárása
ru: Закрыть соединение
zh_hans: 关闭连接
