Repository: 2dust/v2rayN
Catalog: v2rayN/ServiceLib/Resx/ResUI.*.resx
Languages: fa_ir, fr, hu, ru, zh_hans

# menuGenGroupMultipleServerSingBoxFallback
source: Multi-Configuration Fallback by sing-box
fr: sing-box basculement (multi-sélection)

# menuGenGroupMultipleServerXrayFallback
source: Multi-Configuration Fallback by Xray
fr: Xray basculement (multi-sélection)

# CoreNotSupportNetwork
source: Core '{0}' does not support network type '{1}'.
fr: Le cœur « {0} » ne prend pas en charge le type de réseau « {1} ».

# CoreNotSupportProtocolTransport
source: Core '{0}' does not support protocol '{1}' when using transport '{2}'.
fr: Le cœur « {0} » ne prend pas en charge le protocole « {1} » avec le mode de transport « {2} ».

# CoreNotSupportProtocol
source: Core '{0}' does not support protocol '{1}'.
fr: Le cœur « {0} » ne prend pas en charge le protocole « {1} ».

# ProxyChainedPrefix
source: Proxy chained:
fr: Chaîne de proxy :

# RoutingRuleOutboundPrefix
source: Routing rule outbound:
fr: Règle de routage sortante :

# PolicyGroupPrefix
source: Policy group:
fr: Groupe de stratégie :

# NodeTagNotExist
source: Node alias '{0}' does not exist.
fr: L’alias « {0} » n’existe pas.

# GroupEmpty
source: Group '{0}' is empty. Please add at least one node.
fr: Le groupe « {0} » est vide. Veuillez ajouter au moins une configuration.

# InvalidProperty
source: The {0} property is invalid, please check.
fr: La propriété {0} est invalide, veuillez vérifier

# GroupSelfReference
source: {0} Group cannot reference itself or have a circular reference
fr: Le groupe {0} ne peut pas se référencer lui-même ni créer de référence circulaire

# NotSupportProtocol
source: Not support protocol '{0}'.
fr: Protocole « {0} » non pris en charge.

# TbSettingsHide2TrayWhenCloseTip
source: If the system does not have a tray function, please do not enable it
fr: Si le système n’a pas de zone de notif., n’activez pas cette option

# TbRuleType
source: Rule Type
fr: Type de règle

# TbRuleTypeTips
source: You can set separate rules for Routing and DNS, or select "ALL" to apply to both
fr: Des règles peuvent être définies séparément pour Routing et DNS ; ALL les applique aux deux

# TbBootstrapDNS
source: Bootstrap DNS
fr: DNS de démarrage (Bootstrap DNS)

# TbBootstrapDNSTips
source: Resolve DNS server domains, requires IP
fr: Résoudre le nom du serveur DNS ; doit être spécifié en IP

# menuFastRealPing
source: Test real delay
fr: Test 1-clic de latence réelle

# LvPort
source: Port
fa_ir: پورت
ru: Порт
zh_hans: 端口

# LvServiceType
source: Type
fa_ir: نوع
hu: Típus
ru: Тип
zh_hans: 类型

# MsgInformationTitle
source: Information
fa_ir: اطلاعات
hu: Információ
ru: Информация
zh_hans: 信息

# LabLocal
source: Local
fa_ir: محلی
hu: Helyi
ru: Локальный
zh_hans: 本地

# TbRemarks
source: Alias (remarks)
fa_ir: نام مستعار (ملاحظات)
hu: Alias (megjegyzések)
ru: Примечание
zh_hans: 别名 (remarks)

# TbSortingType
source: Type
fa_ir: نوع
hu: Típus
ru: Тип
zh_hans: 类型

# menuModeDirect
source: Direct
fa_ir: مستقیم
hu: Közvetlen
ru: Прямое соединение
zh_hans: 直连

# menuModeGlobal
source: Global
fa_ir: جهانی
hu: Globális
ru: Глобальный режим
zh_hans: 全局

# menuLocalBackupAndRestore
source: Local
fa_ir: محلی
hu: Helyi
ru: Локально
zh_hans: 本地

# menuRegionalPresetsIran
source: Iran
fa_ir: ایران
hu: Irán
ru: Иран
zh_hans: 伊朗

# TbPrivateKey
source: Private Key
fa_ir: کلید خصوصی
hu: Privát kulcs
ru: Приватный ключ

# TbReserved
source: Reserved (2,3,4)
hu: Fenntartott (2,3,4)
ru: Зарезервировано (2, 3, 4)

# TbLocalAddress
source: Address (IPv4, IPv6)
fa_ir: آدرس (IPv4, IPv6)
hu: Cím (IPv4, IPv6)
ru: Адрес (Ipv4,Ipv6)

# TbPublicKey
source: Public Key
hu: Nyilvános kulcs

# TbShortId
source: Short Id
hu: Rövid azonosító
