Repository: 2dust/v2rayN
Catalog: v2rayN/ServiceLib/Resx/ResUI.*.resx
Languages: fa_ir, fr, hu, ru, zh_hans

# menuConnectionCloseAll
source: Close All Connections
fa_ir: تمام اتصالات را ببندید
fr: Fermer toutes les connexions
hu: Összes kapcsolat bezárása
ru: Закрыть все соединения
zh_hans: 关闭所有连接

# TbProxies
source: Proxies
fa_ir: پروکسی
fr: Proxies actuels
hu: Proxyk
ru: Прокси
zh_hans: 当前代理

# menuRulemode
source: Rule mode
fa_ir: نوع قانون
fr: Mode règle
hu: Szabály mód
ru: Режим правила
zh_hans: 规则模式

# menuModeNothing
source: Do not change
fa_ir: تغییر نده
fr: Suivre la configuration d’origine
hu: Ne változtassa meg
ru: Не менять
zh_hans: 随原配置

# menuModeRule
source: Rule
fa_ir: قانون
fr: Règle
hu: Szabály
ru: Правила
zh_hans: 规则

# menuProxiesDelaytest
source: Latency Test
fa_ir: تست تأخیر
fr: Test de latence
hu: Késleltetés teszt
ru: Тест задержки
zh_hans: 延迟测试

# menuProxiesDelaytestPart
source: Part Node Latency Test
fa_ir: تست تاخیر قسمت گره (نقطه اتصال)
fr: Test de latence partiel actuel
hu: Részleges csomópont késleltetés teszt
ru: Тест задержки выбранных узлов
zh_hans: 当前部分节点延迟测试

# menuProxiesReload
source: Refresh Proxies
fa_ir: تازه سازی پروکسی ها
fr: Actualiser
hu: Proxyk frissítése
ru: Обновить прокси
zh_hans: 刷新

# menuProxiesSelectActivity
source: Select active node (Enter)
fa_ir: انتخاب گره فعال
fr: Définir comme actif (Entrée)
hu: Aktív csomópont kiválasztása (Enter)
ru: Сделать узел активным (Enter)
zh_hans: 设为活动节点 (Enter)

# TbSettingsDomainStrategy4Out
source: Default domain strategy for outbound
fa_ir: استراتژی دامنه پیش فرض برای خروجی
fr: Stratégie de résolution par défaut des sortants
hu: Alapértelmezett tartomány stratégia kimenő forgalomhoz
ru: Стратегия домена по умолчанию для исходящих
zh_hans: Outbound 默认解析策略

# TbSettingsMainGirdOrientation
source: Main layout orientation (requires restart)
fa_ir: جهت چیدمان اصلی (نیاز به راه اندازی مجدد)
fr: Orientation de la mise en page principale (redémarrage requis)
hu: Fő elrendezés iránya (újraindítást igényel)
ru: Основная ориентация макета (требуется перезагрузка)
zh_hans: 主界面布局方向 (需重启)

# TbSettingsDomainDNSAddress
source: Outbound DNS address
fa_ir: آدرس DNS خروجی
fr: Adresse de résolution de domaine pour sortants
hu: Kimenő DNS cím
ru: Исходящий DNS адрес
zh_hans: Outbound 域名解析地址

# menuProfileAutofitColumnWidth
source: Auto column width adjustment
fa_ir: تنظیم خودکار عرض ستون
fr: Ajuster auto. la largeur des colonnes
hu: Oszlopszélesség automatikus beállítása
ru: Автоматическая регулировка ширины столбца
zh_hans: 自动调整列宽

# menuExport2ShareUrlBase64
source: Export Base64-encoded Share Links to Clipboard
fa_ir: صادر کردن پیوندهای اشتراک گذاری کدگذاری شده با Base64 به کلیپ بورد
fr: Exporter les liens de partage en Base64 vers le presse-papiers (multi-sélection)
hu: Base64-kódolt megosztási linkek exportálása vágólapra
ru: Экспорт ссылок в формате Base64 в буфер обмена
zh_hans: 导出分享链接至剪贴板 (多选) Base64 编码

# menuExport2ClientConfigClipboard
source: Export selected Configuration for complete configuration to clipboard
fa_ir: صادر کردن سرور انتخاب شده برای پیکربندی کامل به کلیپ بورد
fr: Exporter la configuration complète sélectionnée vers le presse-papiers
hu: Kijelölt konfiguráció exportálása teljes konfigurációként a vágólapra
ru: Экспортировать выбранный сервер для полной конфигурации в буфер обмена
zh_hans: 导出所选配置文件完整配置至剪贴板

# menuShowOrHideMainWindow
source: Show or hide the main window
fa_ir: نمایش یا پنهان کردن پنجره اصلی
fr: Afficher ou masquer l’interface principale
hu: Főablak megjelenítése vagy elrejtése
ru: Показать или скрыть главное окно
zh_hans: 显示或隐藏主界面

# TbPreSocksPort4Sub
source: Custom config socks port
fa_ir: پیکربندی سفارشی ساکس پورت
fr: Port Socks config personnalisée
hu: Egyéni konfiguráció socks portja
ru: Пользовательская конфигурация порта SOCKS
zh_hans: 自定义配置的 Socks 端口

# menuBackupAndRestore
source: Backup and Restore
fa_ir: پشتیبان گیری و بازیابی
fr: Sauvegarder et restaurer
hu: Biztonsági mentés és visszaállítás
ru: Резервное копирование и восстановление
zh_hans: 备份和还原

# menuLocalBackup
source: Backup to local
fa_ir: پشتیبان گیری به محلی
fr: Sauvegarder localement
hu: Biztonsági mentés helyi tárolóba
ru: Сохранить в файл
zh_hans: 备份到本地

# menuLocalRestore
source: Restore from local
fa_ir: بازیابی از محلی
fr: Restaurer depuis le local
hu: Visszaállítás helyi tárolóból
ru: Восстановить из файла
zh_hans: 从本地恢复

# menuRemoteBackup
source: Backup to remote (WebDAV)
fa_ir: پشتیبان گیری از راه دور (WebDAV)
fr: Sauvegarder vers distant (WebDAV)
hu: Biztonsági mentés távoli helyre (WebDAV)
ru: Резервное копирование на удалённый сервер (WebDAV)
zh_hans: 备份到远程 (WebDAV)

# menuRemoteRestore
source: Restore from remote (WebDAV)
fa_ir: بازیابی از راه دور (WebDAV)
fr: Restaurer depuis distant (WebDAV)
hu: Visszaállítás távoli helyről (WebDAV)
ru: Восстановить с удалённого сервера (WebDAV)
zh_hans: 从远程恢复 (WebDAV)

# menuRemoteBackupAndRestore
source: Remote (WebDAV)
fa_ir: از راه دور (WebDAV)
fr: Distant (WebDAV)
hu: Távoli (WebDAV)
ru: Удалённо (WebDAV)
zh_hans: 远程 (WebDAV)

# LvWebDavUrl
source: WebDAV URL
fa_ir: آدرس اینترنتی WebDav
fr: Adresse du serveur WebDAV
ru: URL WebDAV
zh_hans: WebDav 服务器地址

# LvWebDavUserName
source: WebDAV User Name
fa_ir: نام کاربری WebDav
fr: Compte WebDAV
hu: WebDAV felhasználónév
ru: Имя пользователя WebDAV
zh_hans: WebDav 账户

# LvWebDavPassword
source: WebDAV Password
fa_ir: پسورد WebDav
fr: Mot de passe WebDAV
hu: WebDAV jelszó
ru: Пароль WebDAV
zh_hans: WebDav 密码

# LvWebDavCheck
source: WebDAV Check
fa_ir: چک کردن WebDav
fr: Vérification de disponibilité WebDAV
hu: WebDAV ellenőrzés
ru: Проверить WebDAV
zh_hans: WebDav 可用检查

# LvWebDavDirName
source: Remote folder name (optional)
fa_ir: نام پوشه راه دور (اختیاری)
fr: Nom du dossier distant (optionnel)
hu: Távoli mappa neve (opcionális)
ru: Имя удаленной папки (необязательно)
zh_hans: 远程文件夹名称 (可选)

# LocalRestoreInvalidZipTips
source: Invalid backup file
fa_ir: فایل پشتیبان نامعتبر است
fr: Fichier de sauvegarde invalide
hu: Érvénytelen biztonsági mentés fájl
ru: Неверный файл резервной копии
zh_hans: 无效备份文件

# ConnectionsHostFilterTitle
source: Host filter
fa_ir: فیلتر هسته
fr: Filtre d’hôte
hu: Host szűrő
ru: Фильтр хостов
zh_hans: 主机过滤器

# TipActiveServer
source: Active
fa_ir: فعال سازی
fr: Actif
hu: Aktív
ru: Активный
zh_hans: 活动

# TbSettingsGeoFilesSource
source: Geo files source (optional)
fa_ir: منبع فایل های جغرافیایی (اختیاری)
fr: Source des fichiers Geo (optionnel)
hu: Geo fájlok forrása (opcionális)
ru: Источник файлов Geo (необязательно)
zh_hans: Geo 文件来源 (可选)

# TbSettingsSrsFilesSource
source: sing-box ruleset files source (optional)
fa_ir: منبع فایل های مجموعه قوانین sing-box (اختیاری)
fr: Source des fichiers de jeux de règles sing-box (optionnel)
hu: sing-box szabálykészlet fájlok forrása (opcionális)
ru: Источник файлов наборов правил sing-box (необязательно)
zh_hans: sing-box ruleset 文件来源 (可选)

# UpgradeAppNotExistTip
source: Upgrade App does not exist
fa_ir: برنامه ارتقا وجود ندارد
fr: L’application d’outil de mise à niveau est introuvable
hu: Frissítő alkalmazás nem létezik
ru: Программы для обновления не существует
zh_hans: 升级工具 App 不存在

# TbSettingsRoutingRulesSource
source: Routing rules source (optional)
fa_ir: منبع قوانین مسیریابی (اختیاری)
fr: Source des jeux de règles de routage (optionnel)
hu: Útválasztási szabályok forrása (opcionális)
ru: Источник правил маршрутизации
zh_hans: 路由规则集来源 (可选)

# menuRegionalPresets
source: Regional presets setting
fa_ir: تنظیمات از پیش تعیین شده منطقه ای
fr: Réglages régionaux prédéfinis
hu: Regionális előbeállítások
ru: Региональные пресеты
zh_hans: 区域预置设置

# menuRegionalPresetsDefault
source: Default
fa_ir: پیش فرض
fr: Région par défaut
hu: Alapértelmezett
ru: По умолчанию (Китай)
zh_hans: 默认区域

# menuRegionalPresetsRussia
source: Russia
fa_ir: روسیه
fr: Russie
hu: Oroszország
ru: Россия
zh_hans: 俄罗斯

# TbSettingsChinaUserTip
source: Users in China region can ignore this item
fa_ir: کاربران در منطقه چین می توانند این مورد را نادیده بگیرند
fr: Les utilisateurs de Chine peuvent ignorer
hu: Kínai régióban lévő felhasználók figyelmen kívül hagyhatják ezt az elemet
ru: Пользователи из Китая могут пропустить этот пункт
zh_hans: 中国区域用户可忽略此项

# menuAddServerViaImage
source: Scan QR code in the image
fa_ir: اسکن کردن QRcode موجود در تصویر
fr: Scanner le QR code dans l’image
hu: QR kód beolvasása a képből
ru: Сканировать QR-код с изображения
zh_hans: 扫描图片中的二维码

# InvalidUrlTip
source: Invalid address (URL)
fa_ir: آدرس نامعتبر (آدرس اینترنتی)
fr: Adresse (URL) invalide
hu: Érvénytelen cím (URL)
ru: Неверный адрес (Url)
zh_hans: 地址 (Url) 无效

# InsecureUrlProtocol
source: Please do not use the insecure HTTP protocol subscription address
fa_ir: لطفاً از آدرس اشتراک پروتکل HTTP ناامن استفاده نکنید
fr: N’utilisez pas d’adresse d’abonnement HTTP non sécurisée
hu: Kérjük, ne használjon nem biztonságos HTTP protokoll előfizetési címet
ru: Не используйте небезопасный адрес подписки по протоколу HTTP
zh_hans: 请不要使用不安全的 HTTP 协议订阅地址

# TbSettingsCurrentFontFamilyLinuxTip
source: Install the font to the system, select or fill in the font name, restart the settings
fa_ir: فونت را روی سیستم نصب کنید و تنظیمات را مجددا راه اندازی کنید
fr: Installer la police sur le système, choisir ou saisir son nom, effet après redémarrage
hu: Telepítse a betűtípust a rendszerbe, válassza ki vagy töltse ki a betűtípus nevét, indítsa újra a beállításokat
ru: Установите шрифт в систему и перезапустите настройки
zh_hans: 安装字体到系统中，选择或填入字体名称，重启生效

# menuExitTips
source: Are you sure you want to exit?
fa_ir: آیا مطمئن هستید که خارج می شوید؟
fr: Voulez-vous vraiment quitter ?
hu: Biztosan ki akar lépni?
ru: Вы уверены, что хотите выйти?
zh_hans: 是否确定退出？

# LvMemo
source: Remarks Memo
fa_ir: یادداشت ملاحظات
fr: Mémo
hu: Megjegyzések
ru: Заметка (Memo)
zh_hans: 备注备忘

# TbSettingsLinuxSudoPassword
source: System sudo password
fa_ir: رمز عبور sudo سیستم
fr: Mot de passe sudo système
hu: Rendszer sudo jelszó
ru: Пароль sudo системы
zh_hans: 系统的 sudo 密码

# TbSettingsLinuxSudoPasswordTip
source: The password will be validated via the command line. If a validation error causes the application to malfunction, please restart the application. The password will not be stored and must be entered again after each restart.
fr: Le mot de passe sera vérifié en ligne de commande. En cas d’échec ou de dysfonctionnement, redémarrez l’application. Il n’est pas stocké et doit être saisi à chaque redémarrage.
hu: A jelszót a parancssoron keresztül ellenőrizzük. Ha egy érvényesítési hiba miatt az alkalmazás hibásan működik, indítsa újra az alkalmazást. A jelszó nem kerül tárolásra, és minden újraindítás után újra meg kell adni.
ru: Введенный вами пароль не может быть подтвержден, поэтому убедитесь, что вы ввели его правильно. Если приложение не работает должным образом из-за неправильного ввода, то перезапустите его. Пароль не будет сохранен, и вам придется вводить его заново после каждого перезапуска
zh_hans: 密码将调用命令行校验，如果因为校验错误导致无法正常运行时，请重启本应用。 密码不会存储，每次重启后都需要再次输入。

# TransportHeaderTypeTip5
source: *xhttp mode
fa_ir: *حالت xhttp
fr: *Mode XHTTP
hu: *xhttp mód
ru: *XHTTP-режим
zh_hans: *XHTTP 模式

# TransportExtraTip
source: XHTTP Extra raw JSON, format: { XHTTP Object }
fa_ir: جیسون خام XHTTP Extra, فرمت: { XHTTPObject }
fr: JSON brut XHTTP Extra, format : { XHTTPObject }
hu: XHTTP Extra nyers JSON, formátum: { XHTTP Objektum }
ru: Дополнительный XHTTP сырой JSON, формат: { XHTTPObject }
zh_hans: XHTTP Extra 原始 JSON，格式： { XHTTPObject }

# TbSettingsHide2TrayWhenClose
source: Hide to tray when closing the window
fa_ir: هنگام بستن پنجره در سینی پنهان شوید
fr: Masquer dans la barre d’état lors de la fermeture de la fenêtre
hu: Ablak bezárásakor a tálcára rejtés
ru: Скрыть в трее при закрытии окна
zh_hans: 关闭窗口时隐藏至托盘

# TbSettingsMixedConcurrencyCount
source: The number of concurrent tests during multi-test
fa_ir: تعداد همزمان در طول چند آزمون
fr: Niveau de concurrence lors des tests multithread
hu: A párhuzamos tesztek száma több teszt során
ru: Количество одновременно выполняемых тестов при многоэтапном тестировании
zh_hans: 多线程测试时的并发数量

# TbSettingsExceptionTip2
source: Exclusions: Do not use proxy server for the following addresses. Use comma (,) to separate entries.
fa_ir: موارد استثنا: از سرور پروکسی برای آدرس های زیر استفاده نکنید. برای جدا کردن ورودی ها از کاما (،) استفاده کنید.
fr: Exceptions : ne pas utiliser le proxy pour ces adresses, séparées par des virgules (,).
hu: Kivételek: Ne használjon proxy szervert a következő címekhez. Vesszővel (,) válassza el a bejegyzéseket.
ru: Исключение. Не используйте прокси-сервер для адресов с запятой (,)
zh_hans: 例外：对于下列地址不使用代理配置文件。使用逗号 (,) 分隔。

# TbSettingsDestOverride
source: Sniffing type
fa_ir: نوع Sniffing
fr: Type de détection de trafic
hu: Sniffing típus
ru: Тип сниффинга
zh_hans: 流量探测类型

# TbSettingsSecondLocalPortEnabled
source: Enable second mixed port
fa_ir: فعال کردن دومین پورت ترکیبی
fr: Activer un second port d’écoute local
hu: Második vegyes port engedélyezése
ru: Включить второй смешанный порт
zh_hans: 开启第二个本地监听端口

# TbRoutingInboundTagTips
source: socks: local port, socks2: second local port, socks3: LAN port
fa_ir: socks:پورت محلی، socks2: پورت دوم محلی، socks3: پورت LAN
fr: Socks : port local ; Socks2 : deuxième port local ; Socks3 : port LAN
hu: socks: helyi port, socks2: második helyi port, socks3: LAN port
ru: socks: локальный порт, socks2: второй локальный порт, socks3: LAN порт
zh_hans: Socks：本地端口，Socks2：第二个本地端口，Socks3：局域网端口

# TbSettingsTheme
source: Theme
fa_ir: تم
fr: Thème
hu: Téma
ru: Темы
zh_hans: 主题

# menuCopyProxyCmdToClipboard
source: Copy proxy command to clipboard
fa_ir: کپی کردن دستور پروکسی در کلیپ بورد
fr: Copier la commande proxy terminal vers le presse-papiers
hu: Proxy parancs másolása vágólapra
ru: Копировать команду прокси в буфер обмена
zh_hans: 复制终端代理命令至剪贴板

# SpeedtestingTestFailedPart
source: Starting retesting failed parts, {0} remaining. Press ESC to terminate...
fa_ir: شروع آزمایش مجدد قطعات ناموفق، {0} باقی مانده است. برای خاتمه ESC را فشار دهید...
fr: Recommencer le test des éléments échoués, {0} restants. Appuyez sur Échap pour arrêter...
hu: Sikertelen részek újratesztelése elindult, {0} maradt. ESC megnyomásával megszakítható...
ru: Повторное тестирование неудачных элементов, осталось {0}. Нажмите ESC для остановки…
zh_hans: 开始对失败部分进行重新测试，剩余 {0} 个。可按 ESC 终止...

# menuTestServerResult
source: By test result
fa_ir: با نتیجه آزمایش
fr: Selon le résultat des tests
hu: Teszt eredmény szerint
ru: По результату теста
zh_hans: 按测试结果

# menuRemoveInvalidServerResult
source: Remove invalid by test results
fa_ir: حذف نامعتبر با نتایج آزمایش
fr: Supprimer les éléments invalides selon résultats tests
hu: Érvénytelenek eltávolítása teszteredmények alapján
ru: Удалить недействительные по результатам теста
zh_hans: 按测试结果移除无效

# RemoveInvalidServerResultTip
source: Removed {0} invalid test results.
fa_ir: {0} نتایج آزمایش نامعتبر حذف شد.
fr: {0} résultats de test invalides supprimés.
hu: Eltávolítva {0} érvénytelen teszteredmény.
ru: Удалено {0} недействительных
zh_hans: 移除无效测试结果 {0} 个。

# TbPorts7
source: Configuration port range
fa_ir: محدوده پورت سرور
fr: Plage de ports sautés
hu: Konfigurációs port tartomány
ru: Диапазон портов сервера
zh_hans: 跳跃端口范围

# TbPorts7Tips
source: Will cover the port, separate with commas (,)
fa_ir: مخفی و پورت می شود، با کاما (،) جدا می شود
fr: Écrase le port ; pour plusieurs groupes, séparez par des virgules (,)
hu: A portot lefedi, vesszővel (,) elválasztva
ru: Заменит указанный порт, перечисляйте через запятую (,)
zh_hans: 会覆盖端口，多组时用逗号 (,) 隔开

# menuGenGroupMultipleServer
source: Generate Policy Group from Multiple Profiles
fr: Générer un groupe de stratégie depuis plusieurs profils

# menuGenGroupMultipleServerXrayRandom
source: Multi-Configuration Random by Xray
fa_ir: چند سرور تصادفی توسط Xray
fr: Xray aléatoire (multi-sélection)

# menuGenGroupMultipleServerXrayRoundRobin
source: Multi-Configuration RoundRobin by Xray
fa_ir: چند سرور RoundRobin توسط Xray
fr: Xray équilibrage (tourniquet) multi-sélection

# menuGenGroupMultipleServerXrayLeastPing
source: Multi-Configuration LeastPing by Xray
fa_ir: چند سرور LeastPing توسط Xray
fr: Xray latence minimale (multi-sélection)

# menuGenGroupMultipleServerXrayLeastLoad
source: Multi-Configuration LeastLoad by Xray
fa_ir: چند سرور LeastLoad توسط Xray
fr: Xray le plus stable (multi-sélection)

# menuGenGroupMultipleServerSingBoxLeastPing
source: Multi-Configuration LeastPing by sing-box
fa_ir: LeastPing چند سرور توسط sing-box
fr: sing-box latence minimale (multi-sélection)

# menuExportConfig
source: Export Configuration
fa_ir: صادر کردن سرور
fr: Exporter
hu: Konfiguráció exportálása
ru: Экспортировать конфигурацию
zh_hans: 导出配置文件

# TbSettingsIPAPIUrl
source: Current connection info test URL
fa_ir: URL آزمایش اطلاعات اتصال فعلی
fr: Adresse de test d’informations de connexion actuelles
hu: Aktuális kapcsolat info teszt URL
ru: URL для тестирования текущего соединения
zh_hans: 当前连接信息测试地址

# TbRuleOutboundTagTip
source: Can fill in the configuration remarks, please make sure it exist and are unique
fr: Vous pouvez saisir un alias de configuration ; assurez-vous qu’il existe et qu’il est unique
hu: Kitöltheti a konfigurációs megjegyzéseket, kérjük, győződjön meg róla, hogy létezik és egyedi
zh_hans: 可以填写配置文件别名，请确保存在并唯一

# SudoIncorrectPasswordTip
source: Incorrect password, please try again.
fr: Mot de passe incorrect, veuillez réessayer.
hu: Helytelen jelszó, próbálja újra.
zh_hans: 密码错误，请重试。

# menuAddAnytlsServer
source: Add [Anytls] Configuration
fr: Ajouter [Anytls]
hu: [Anytls] konfiguráció hozzáadása
zh_hans: 添加 [Anytls] 配置文件

# TbRemoteDNS
source: Remote DNS
fr: DNS distant
zh_hans: 远程 DNS

# TbDomesticDNS
source: Domestic DNS
fr: DNS direct
zh_hans: 直连 DNS

# TbRemoteDNSTips
source: Via proxy — please ensure remote availability
fr: Via le proxy ; assurez-vous que le serveur distant est disponible

# TbXrayFreedomStrategy
source: xray Freedom Resolution Strategy
fr: Stratégie de résolution xray freedom

# TbSBDirectResolveStrategy
source: sing-box Direct Resolution Strategy
fr: Stratégie de résolution directe sing-box
zh_hans: sing-box 直连解析策略

# TbSBRemoteResolveStrategy
source: sing-box Remote Resolution Strategy
fr: Stratégie de résolution distante sing-box
zh_hans: sing-box 远程解析策略

# TbAddCommonDNSHosts
source: Add Common DNS Hosts
fr: Ajouter des hôtes DNS courants
zh_hans: 添加常用 DNS Hosts

# TbBlockSVCBHTTPSQueries
source: Block SVCB and HTTPS Queries
fr: Bloquer les requêtes SVCB et HTTPS
zh_hans: 阻止 SVCB 和 HTTPS 查询

# TbDNSHostsConfig
source: DNS Hosts: ("domain1 ip1 ip2" per line)
fr: Hôtes DNS : (« domaine1 ip1 ip2 » une ligne par entrée)
zh_hans: DNS Hosts：（“域名1 ip1 ip2” 一行一个）

# ThBasicDNSSettings
source: Basic DNS Settings
fr: Paramètres DNS de base
zh_hans: DNS 基础设置

# ThAdvancedDNSSettings
source: Advanced DNS Settings
fr: Paramètres DNS avancés
zh_hans: DNS 进阶设置

# TbValidateDirectExpectedIPs
source: Validate Regional Domain IPs
fr: Valider les IP des domaines de la région concernée
zh_hans: 校验相应地区域名 IP

# TbValidateDirectExpectedIPsDesc
source: When configured, validates IPs returned for regional domains (e.g., geosite:cn), returning only expected IPs
fr: Après configuration, les IP renvoyées pour les domaines régionaux (p. ex. geosite:cn) seront validées ; seules les IP attendues seront retournées
zh_hans: 配置后，会对相应地区域名（如 geosite:cn）的返回 IP 进行校验，仅返回期望 IP

# TbCustomDNSEnable
source: Enable Custom DNS
fr: Activer le DNS personnalisé
zh_hans: 启用自定义 DNS

# TbCustomDNSEnabledPageInvalid
source: Custom DNS Enabled, This Page's Settings Invalid
fr: DNS personnalisé activé ; la configuration de cette page sera ignorée
zh_hans: 自定义 DNS 已启用，此页面配置将无效

# TbBlockSVCBHTTPSQueriesTips
source: Block ECH and HTTP/3 availability checks when enabled
fr: Une fois activé, bloque les requêtes ECH et de disponibilité HTTP/3
hu: Prevent domain-based routing rules from failing
zh_hans: 避免域名分流规则失效

# FillCorrectConfigTemplateText
source: Please fill in the correct config template
fr: Veuillez saisir un modèle de configuration valide
zh_hans: 请填写正确的配置模板

# menuFullConfigTemplate
source: Full Config Template Setting
fr: Paramètres du modèle de config complet
zh_hans: 完整配置模板设置

# TbFullConfigTemplateEnable
source: Enable Full Config Template
fr: Activer le modèle de configuration complet
zh_hans: 启用完整配置模板

# TbRayFullConfigTemplate
source: v2ray Full Config Template
fr: Modèle de configuration complet v2ray
zh_hans: v2ray 完整配置模板

# TbRayFullConfigTemplateDesc
source: Add Outbound Config Only, routing.balancers and routing.rules.outboundTag, Click to view the document
fr: Ajoute seulement la configuration sortante, routing.balancers et routing.rules.outboundTag. Voir la documentation.
zh_hans: 仅添加出站配置，routing.balancers 和 routing.rules.outboundTag，点击查看文档

# TbAddProxyProtocolOutboundOnly
source: Do Not Add Non-Proxy Protocol Outbound
fr: Ne pas ajouter de sorties pour les protocoles non proxy
zh_hans: 不添加非代理协议出站

# TbSetUpstreamProxyDetour
source: Set Upstream Proxy Tag
fr: Définir le tag du proxy amont
zh_hans: 设置上游代理 tag

# TbSBFullConfigTemplate
source: sing-box Full Config Template
fr: Modèle de configuration complet sing-box
zh_hans: sing-box 完整配置模板

# TbSBFullConfigTemplateDesc
source: Add Outbound and Endpoint Config Only, Click to view the document
fr: Ajoute uniquement la configuration des sortants et des endpoints ; cliquer pour voir la documentation
zh_hans: 仅添加出站和端点配置，点击查看文档

# TbFullConfigTemplateDesc
source: This feature is intended for advanced users and those with special requirements. Once enabled, it will ignore the Core's basic settings, DNS settings, and routing settings. You must ensure that the system proxy port, traffic statistics, and other related configurations are set correctly — everything will be configured by you.
fr: Cette fonction s’adresse aux utilisateurs avancés et aux besoins spécifiques. Une fois activée, les paramètres de base du Core, du DNS et du routage sont ignorés. Vous devez vous assurer que la configuration des ports du proxy système, des statistiques de trafic, etc., est correcte — tout est à votre charge.
zh_hans: 此功能供高级用户和有特殊需求的用户使用。 启用此功能后，将忽略 Core 的基础设置，DNS 设置 ，路由设置。你需要保证系统代理的端口和流量统计等功能的配置正确，一切都由你来设置。

# MsgStartParsingSubscription
source: Start parsing and processing subscription content
fr: Début de l’analyse et du traitement du contenu d’abonnement
zh_hans: 开始解析和处理订阅内容

# TbSelectProfile
source: Select Profile
fr: Sélectionner une configuration
zh_hans: 选择配置文件

# TbFakeIPTips
source: Applies globally by default, with built-in FakeIP filtering (sing-box only).
fr: Actif globalement par défaut, avec filtrage FakeIP intégré ; ne fonctionne que dans sing-box
zh_hans: 默认全局生效，内置 FakeIP 过滤，仅在 sing-box 中生效

# PleaseAddAtLeastOneServer
source: Please Add At Least One Configuration
fr: Veuillez ajouter au moins une configuration

# TbConfigTypePolicyGroup
source: Policy Group
fr: Groupe de stratégie

# TbConfigTypeProxyChain
source: Proxy Chain
fr: Chaîne de proxy

# TbLeastPing
source: Lowest Latency
fr: Latence minimale

# TbRandom
source: Random
fr: Aléatoire

# TbRoundRobin
source: Round Robin
fr: Tourniquet (round-robin)

# TbLeastLoad
source: Most Stable
fr: Le plus stable

# TbPolicyGroupType
source: Policy Group Type
fr: Type de groupe de stratégie

# menuAddPolicyGroupServer
source: Add Policy Group Configuration
fr: Ajouter un groupe de stratégie

# menuAddProxyChainServer
source: Add Proxy Chain Configuration
fr: Ajouter une chaîne de proxy

# menuAddChildServer
source: Add Child Configuration
fr: Ajouter un enfant

# menuRemoveChildServer
source: Remove Child Configuration
fr: Supprimer l’enfant

# menuServerList
source: Configuration List
fa_ir: Configuration item 1, Auto add from subscription group
fr: Liste des enfants

# TbFallback
source: Fallback
fr: Basculement (failover)
