Repository: 2dust/v2rayN
Catalog: v2rayN/ServiceLib/Resx/ResUI.*.resx
Languages: fa_ir, fr, hu, ru, zh_hans

# BatchExportURLSuccessfully
source: Export share link to clipboard successfully
fa_ir: ارسال دسته ای آدرس اینترنتی اشتراک گذاری به کلیپ بورد با موفقیت.
fr: Lien de partage exporté vers le presse-papiers avec succès
hu: Sikeresen exportálta a megosztási linket a vágólapra
ru: Ссылка успешно скопирована в буфер обмена
zh_hans: 导出分享链接至剪贴板成功

# CheckServerSettings
source: Please check the Configuration settings first.
fa_ir: لطفا ابتدا تنظیمات سرور را بررسی کنید
fr: Veuillez vérifier d’abord la config
hu: Kérjük, először ellenőrizze a konfigurációs beállításokat.
ru: Сначала проверьте настройки сервера
zh_hans: 请先检查配置文件设置

# ConfigurationFormatIncorrect
source: Invalid configuration format.
fa_ir: فرمت پیکربندی نادرست است
fr: Format de configuration incorrect
hu: Érvénytelen konfigurációs formátum.
ru: Недопустимый формат конфигурации
zh_hans: 配置格式不正确

# CustomServerTips
source: Note that custom configuration relies entirely on your own configuration and does not work with all settings. If you want to use the system proxy, please modify the listening port manually.
fa_ir: توجه داشته باشید که پیکربندی سفارشی کاملاً به پیکربندی خود شما بستگی دارد و با همه تنظیمات کار نمی کند. اگر می خواهید از پروکسی سیستم استفاده کنید، لطفاً پورت درحال شنود را به صورت دستی تغییر دهید.
fr: Attention : la configuration personnalisée dépend entièrement de vos paramètres et peut ne pas activer toutes les fonctions. Pour utiliser le proxy système, changez le port d’écoute manuellement.
hu: Ne feledje, hogy az egyéni konfiguráció teljes mértékben a saját konfigurációjától függ, és nem működik minden beállítással. Ha a rendszerproxyt szeretné használni, kérjük, manuálisan módosítsa a figyelő portot.
ru: Обратите внимание, что пользовательская конфигурация полностью зависит от вашей собственной конфигурации и работает не со всеми настройками. Если вы хотите использовать системный прокси, то измените порт прослушивания вручную
zh_hans: 注意，自定义配置完全依赖您自己的配置，不能使用所有设置功能。如需使用系统代理请手动修改监听端口。

source: Downloading...
fa_ir: درحال دانلود...
fr: Téléchargement commencé...
hu: Letöltés...
ru: Загрузка...
zh_hans: 下载开始...

# FailedConversionConfiguration
source: Failed to convert configuration file
fa_ir: تبدیل فایل پیکربندی انجام نشد
fr: Échec de la conversion de la configuration
hu: Nem sikerült a konfigurációs fájl konvertálása
ru: Не удалось преобразовать файл конфигурации
zh_hans: 转换配置文件失败

# FailedGenDefaultConfiguration
source: Failed to generate default configuration file
fa_ir: فایل پیکربندی پیش فرض ایجاد نشد
fr: Échec de la génération du fichier de configuration par défaut
hu: Nem sikerült az alapértelmezett konfigurációs fájl generálása
ru: Не удалось создать файл конфигурации по умолчанию
zh_hans: 生成默认配置文件失败

# FailedGetDefaultConfiguration
source: Failed to get the default configuration
fa_ir: پیکربندی پیش فرض دریافت نشد
fr: Échec de l’obtention de la configuration par défaut
hu: Nem sikerült lekérni az alapértelmezett konfigurációt
ru: Не удалось получить конфигурацию по умолчанию
zh_hans: 获取默认配置失败

# FailedImportedCustomServer
source: Failed to import custom configuration Configuration
fa_ir: سرور پیکربندی سفارشی وارد نشد
fr: Échec de l’importation de la configuration personnalisée
hu: Nem sikerült importálni az egyéni konfigurációt
ru: Не удалось импортировать сервер пользовательской конфигурации
zh_hans: 导入自定义配置文件失败

# FailedReadConfiguration
source: Failed to read configuration file
fa_ir: فایل پیکربندی خوانده نشد
fr: Échec de la lecture de la configuration
hu: Nem sikerült olvasni a konfigurációs fájlt
ru: Не удалось прочитать файл конфигурации
zh_hans: 读取配置文件失败

# FillCorrectServerPort
source: Please enter the correct port format.
fa_ir: لطفا فرمت صحیح پورت سرور را وارد کنید.
fr: Veuillez saisir un port au format correct
hu: Kérjük, adja meg a helyes port formátumot.
ru: Укажите порт сервера в правильном формате
zh_hans: 请填写正确格式的端口

# FillLocalListeningPort
source: Please enter the local listening port.
fa_ir: لطفاً پورت گوش دادن محلی را وارد کنید.
fr: Veuillez saisir le port d’écoute local
hu: Kérjük, adja meg a helyi figyelő portot.
ru: Введите локальный порт для прослушивания
zh_hans: 请填写本地监听端口

# FillPassword
source: Please enter the password.
fa_ir: لطفا رمز عبور را وارد کنید.
fr: Veuillez saisir le mot de passe
hu: Kérjük, adja meg a jelszót.
ru: Введите пароль
zh_hans: 请填写密码

# FillServerAddress
source: Please enter the address.
fa_ir: لطفا آدرس سرور را وارد کنید.
fr: Veuillez saisir l’adresse
hu: Kérjük, adja meg a címet.
ru: Введите адрес сервера
zh_hans: 请填写地址

# FillUUID
source: Please enter the user ID.
fa_ir: لطفا شناسه کاربری را وارد کنید.
fr: Veuillez saisir l’ID utilisateur
hu: Kérjük, adja meg a felhasználói azonosítót.
ru: Введите идентификатор пользователя
zh_hans: 请填写用户 ID

# Incorrectconfiguration
source: This is not the correct configuration, please check
fa_ir: این پیکربندی صحیحی نیست، لطفا بررسی کنید.
fr: Configuration incorrecte, veuillez vérifier
hu: Ez nem a megfelelő konfiguráció, kérjük, ellenőrizze
ru: Некорректная конфигурация. Проверьте
zh_hans: 配置不正确，请检查

source: Initial Configuration
fa_ir: پیکربندی اولیه
fr: Initialiser la configuration
hu: Kezdeti konfiguráció
ru: Исходная конфигурация
zh_hans: 初始化配置

# IsLatestCore
source: {0} {1} already up to date.
fa_ir: {0} {1} در حال حاضر به روز است.
fr: {0} {1} est déjà à jour.
hu: {0} {1} már naprakész.
ru: {0} {1} является последней версией
zh_hans: {0} {1} 已是最新版本。

# IsLatestN
source: {0} {1} already up to date.
fa_ir: {0} {1} در حال حاضر به روز است.
fr: {0} {1} est déjà à jour.
hu: {0} {1} már naprakész.
ru: {0} {1} является последней версией
zh_hans: {0} {1} 已是最新版本。

# LvAddress
source: Address
fa_ir: آدرس
fr: Adresse
hu: Cím
ru: Адрес
zh_hans: 地址

# LvEncryptionMethod
source: Security
fa_ir: امنیت
fr: Méthode de chiffrement
hu: Biztonság
ru: Метод шифрования
zh_hans: 加密方式

# LvSubscription
source: Subs group
fa_ir: گروه فرعی
fr: Grp abonn.
hu: Előfizetés csoport
ru: Группа подписки
zh_hans: 订阅分组

# LvTodayDownloadDataAmount
source: Download traffic today
fa_ir: ترافیک دانلود امروز
fr: Téléchargement du jour
hu: Mai letöltési forgalom
ru: Загружено трафика сегодня
zh_hans: 今日下载

# LvTodayUploadDataAmount
source: Upload traffic today
fa_ir: ترافیک اپلود امروز
fr: Téléversement du jour
hu: Mai feltöltési forgalom
ru: Отправлено сегодня
zh_hans: 今日上传

# LvTotalDownloadDataAmount
source: Total download traffic
fa_ir: کل ترافیک دانلود
fr: Total téléchargé
hu: Összes letöltési forgalom
ru: Всего загружено
zh_hans: 总下载

# LvTotalUploadDataAmount
source: Total upload traffic
fa_ir: کل ترافیک آپلود
fr: Total téléversé
hu: Összes feltöltési forgalom
ru: Всего отдано
zh_hans: 总上传

# LvTransportProtocol
source: Transport
fa_ir: جابجایی
fr: Protoc. Transport
hu: Szállítás
ru: Протокол
zh_hans: 传输协议

# MsgDownloadV2rayCoreSuccessfully
source: Downloaded Core successfully
fa_ir: هسته با موفقیت دانلود شد
fr: Téléchargement du Core réussi
hu: A Core sikeresen letöltve
ru: Ядро успешно загружено
zh_hans: 下载 Core 成功

# MsgFailedImportSubscription
source: Failed to import subscription content
fa_ir: محتوای اشتراک با موفقیت وارد نشد
fr: Échec de l’importation du contenu d’abonnement
hu: Nem sikerült importálni az előfizetés tartalmát
ru: Не удалось импортировать подписку
zh_hans: 导入订阅内容失败

# MsgGetSubscriptionSuccessfully
source: Got subscription content successfully
fa_ir: محتوای اشتراک با موفقیت دریافت شد
fr: Contenu d’abonnement récupéré avec succès
hu: Az előfizetés tartalma sikeresen lekérve
ru: Содержимое подписки успешно импортировано
zh_hans: 获取订阅内容成功

# MsgNoValidSubscription
source: No valid subscriptions set
fa_ir: هیچ اشتراک معتبری تنظیم نشده است
fr: Aucun abonnement valide défini
hu: Nincs érvényes előfizetés beállítva
ru: Нет установленных подписок
zh_hans: 未设置有效的订阅

# MsgParsingSuccessfully
source: Resolved {0} successfully
fa_ir: {0} با موفقیت حل شد
fr: Analyse de {0} réussie
ru: Парсинг {0} прошел успешно
zh_hans: 解析 {0} 成功

# MsgStartGettingSubscriptions
source: Started getting subscriptions
fa_ir: شروع به دریافت اشتراک کرد
fr: Début de la récupération du contenu d’abonnement
hu: Előfizetések lekérdezése elindult
ru: Начинаю получать подписки
zh_hans: 开始获取订阅内容

# MsgStartUpdating
source: Started updating {0}...
fa_ir: شروع به‌روزرسانی {0}...
fr: Début de la mise à jour de {0}...
hu: Frissítés indítása: {0}...
ru: Начинаю обновление {0}...
zh_hans: 开始更新 {0}...

# MsgSubscriptionDecodingFailed
source: Invalid subscription content
fa_ir: محتوای اشتراک نامعتبر است
fr: Contenu d’abonnement invalide
hu: Érvénytelen előfizetés tartalom
ru: Некорректное содержимое подписки
zh_hans: 无效的订阅内容

# MsgUnpacking
source: Unpacking...
fa_ir: باز کردن بسته بندی...
fr: Décompression en cours......
hu: Kicsomagolás...
ru: Распаковка…
zh_hans: 正在解压......

# MsgUpdateSubscriptionEnd
source: Subscription update ended
fa_ir: بروزرسانی اشتراک به پایان رسید
fr: Fin de la mise à jour des abonnements
hu: Előfizetés frissítése befejeződött
ru: Обновление подписки закончено
zh_hans: 更新订阅结束

# MsgUpdateSubscriptionStart
source: Subscription update started
fa_ir: بروزرسانی اشتراک شروع شد
fr: Début de la mise à jour des abonnements
hu: Előfizetés frissítése elindult
ru: Обновление подписки начинается
zh_hans: 更新订阅开始

# MsgUpdateV2rayCoreSuccessfully
source: Updated Core successfully
fa_ir: هسته با موفقیت بروزرسانی شد
fr: Mise à jour du Core réussie
hu: A Core sikeresen frissítve
ru: Ядро успешно обновлено
zh_hans: 更新 Core 成功

# MsgUpdateV2rayCoreSuccessfullyMore
source: Updated Core successfully! Restarting service...
fa_ir: هسته با موفقیت بروزرسانی شد! راه اندازی مجدد سرویس...
fr: Mise à jour du Core réussie ! Redémarrage du service...
hu: A Core sikeresen frissítve! Szolgáltatás újraindítása...
ru: Успешное обновление ядра! Перезапуск службы...
zh_hans: 更新 Core 成功！正在重启服务...

source: Non-VMess or SS protocol
fa_ir: پروتکل غیر VMess یا ss
fr: Protocole non VMess ni ss
hu: Nem VMess vagy SS protokoll
ru: Не является протоколом VMess или Shadowsocks
zh_hans: 非 VMess 或 ss 协议

# NotFoundCore
source: The Core file (file name: {1}) was not found under the folder ({0}), please download and put it in the folder, download address: {2}
fa_ir: فایل Core (نام فایل: {1}) در زیر پوشه ({0}) یافت نشد، لطفاً آن را دانلود کرده و در پوشه قرار دهید، آدرس دانلود: {2}
fr: Fichier Core introuvable dans le dossier ({0}) (nom de fichier : {1}). Veuillez le télécharger puis le placer dans le dossier. Adresse de téléchargement : {2}
hu: A Core fájl (fájlnév: {1}) nem található a mappában ({0}), kérjük, töltse le és helyezze a mappába, letöltési cím: {2}
ru: Файл ядра ({1}) не найден в папке {0}. Скачайте по адресу {2} и поместите его туда
zh_hans: 在文件夹 ({0}) 下未找到 Core 文件 (文件名: {1})，请下载后放入文件夹，下载地址: {2}

# NoValidQRcodeFound
source: Scan completed, no valid QR code found
fa_ir: اسکن کامل شد، QRcode معتبری یافت نشد
fr: Analyse terminée, aucun QR code valide trouvé
hu: Szkennelés befejeződött, nem található érvényes QR kód
ru: Сканирование завершено, не найден корректный QR код
zh_hans: 扫描完成，未发现有效二维码

# OperationFailed
source: Operation failed, please check and retry
fa_ir: عملیات انجام نشد، لطفا بررسی کنید و دوباره امتحان کنید
fr: Échec de l’opération, veuillez vérifier et réessayer
hu: Művelet sikertelen, kérjük, ellenőrizze és próbálja újra
ru: Операция безуспешна, проверьте и попробуйте ещё раз
zh_hans: 操作失败，请检查并重试

source: Please fill Remarks
fa_ir: لطفا ملاحظات را پر کنید
fr: Veuillez saisir un alias
hu: Kérjük, töltse ki a megjegyzéseket
ru: Введите примечания
zh_hans: 请填写别名

# PleaseSelectEncryption
source: Please select the encryption method
fa_ir: لطفاً روش رمزگذاری را انتخاب کنید
fr: Veuillez sélectionner une méthode de chiffrement
hu: Kérjük, válassza ki a titkosítási módszert
ru: Выберите метод шифрования
zh_hans: 请选择加密方式

# PleaseSelectProtocol
source: Please select a protocol
fa_ir: لطفا یک پروتکل انتخاب کنید
fr: Veuillez sélectionner un protocole
hu: Kérjük, válassza ki a protokollt
ru: Выберите протокол
zh_hans: 请选择协议

# PleaseSelectServer
source: Please select the Configuration first
fa_ir: لطفا ابتدا سرور را انتخاب کنید
fr: Sélectionnez d’abord une configuration
hu: Kérjük, először válassza ki a konfigurációt
ru: Сначала выберите сервер
zh_hans: 请先选择配置文件

# RemoveDuplicateServerResult
source: Configurations deduplication completed. Old: {0}, New: {1}.
fa_ir: حذف مجدد سرورها تکمیل شد. قدیمی: {0}، جدید: {1}.
fr: Déduplication des configurations terminée. Quantité initiale : {0}, quantité actuelle : {1}.
hu: Konfigurációk deduplikálása befejeződött. Régi: {0}, Új: {1}.
ru: Удаление дублей завершено. Старая: {0}, Новая: {1}
zh_hans: 配置文件去重完成。原数量: {0}，现数量: {1}。

# RemoveServer
source: Are you sure you want to remove the Configuration?
fa_ir: آیا مطمئن هستید که می خواهید سرور را حذف کنید؟
fr: Confirmer la suppression ?
hu: Biztosan eltávolítja a konfigurációt?
ru: Вы уверены, что хотите удалить сервер?
zh_hans: 是否确定移除配置文件？

# SaveClientConfigurationIn
source: The client configuration file is saved at: {0}
fa_ir: فایل پیکربندی کلاینت در این آدرس ذخیره می شود: {0}
fr: Le fichier de configuration client est enregistré dans : {0}
hu: Az ügyfélkonfigurációs fájl mentése itt: {0}
ru: Файл конфигурации клиента сохранен по адресу: {0}
zh_hans: 客户端配置文件保存在：{0}

# StartService
source: Starting service ({0})...
fa_ir: شروع سرویس ({0})...
fr: Démarrage du service ({0})...
hu: Szolgáltatás indítása ({0})...
ru: Запуск сервиса ({0})...
zh_hans: 启动服务 ({0})...

# SuccessfulConfiguration
source: Configuration successful. {0}
fa_ir: پیکربندی با موفقیت انجام شد{0}
fr: Configuration réussie. {0}
hu: Konfiguráció sikeres. {0}
ru: Конфигурация выполнена успешно {0}
zh_hans: 配置成功。 {0}

# SuccessfullyImportedCustomServer
source: Custom configuration Configuration imported successfully
fa_ir: سرور پیکربندی سفارشی با موفقیت وارد شد.
fr: Configuration personnalisée importée avec succès
hu: Egyéni konfiguráció sikeresen importálva
ru: Пользовательская конфигурация сервера успешно импортирована
zh_hans: 成功导入自定义配置文件

# SuccessfullyImportedServerViaClipboard
source: {0} Configurations have been imported from clipboard
fa_ir: {0} سرورها از کلیپ بورد وارد شده اند.
fr: {0} configurations importées depuis le presse-papiers
hu: {0} konfiguráció importálva a vágólapról
ru: {0} серверов импортировано из буфера обмена
zh_hans: 成功从剪贴板导入 {0} 个配置文件

# SuccessfullyImportedServerViaScan
source: Successfully scanned and imported the shared link
fa_ir: آدرس اینترنتی با موفقیت اسکن و وارد شد
fr: Lien de partage importé par analyse avec succès
hu: Sikeresen beolvasta és importálta a megosztott linket
ru: Сканирование URL-адреса импорта прошло успешно
zh_hans: 扫描导入分享链接成功

# TestMeOutput
source: The delay: {0} ms, {1}
fa_ir: پینگ سرویس فعلی: {0} ms, {1}
fr: Latence actuelle : {0} ms, {1}
hu: A késleltetés: {0} ms, {1}
ru: Задержка текущего сервера: {0} мс, {1}
zh_hans: 当前延迟: {0} ms，{1}

# OperationSuccess
source: Operation successful
fa_ir: عملیات با موفقیت انجام شد
fr: Opération réussie
hu: Művelet sikeres
ru: Операция успешна
zh_hans: 操作成功

source: Please select rules
fa_ir: لطفا قوانین را انتخاب کنید
fr: Veuillez d’abord sélectionner une règle
hu: Kérjük, válasszon szabályokat
ru: Выберите правила
zh_hans: 请先选择规则

# RemoveRules
source: Are you sure you want to remove the rules?
fa_ir: آیا مطمئن هستید که می خواهید قوانین را حذف کنید؟
fr: Confirmer la suppression de la règle ?
hu: Biztosan eltávolítja a szabályokat?
ru: Вы уверены, что хотите удалить правила?
zh_hans: 是否确定移除规则？

# RoutingRuleDetailRequiredTips
source: {0}, one of the required fields.
fa_ir: {0}، یکی از فیلدهای الزامی است.
fr: {0}, au moins un champ est obligatoire.
hu: {0}, az egyik kötelező mező.
ru: {0}: одно из обязательных полей
zh_hans: {0}，必填其中一项.

# LvRemarks
source: Remarks
fa_ir: ملاحظات
fr: Alias
hu: Megjegyzések
ru: Примечания
zh_hans: 别名

# LvUrl
source: URL (optional)
fa_ir: آدرس اینترنتی (اختیاری)
fr: Adresse optionnelle (URL)
hu: URL (opcionális)
ru: URL (необязательно)
zh_hans: 可选地址 (Url)

# LvCount
source: Count
fa_ir: شمارش
fr: Quantité
hu: Darabszám
ru: Количество
zh_hans: 数量

# MsgNeedUrl
source: Please enter the URL
fa_ir: لطفا آدرس (آدرس اینترنتی) را وارد کنید
fr: Veuillez saisir l’URL
hu: Kérjük, adja meg az URL-t
ru: Введите URL-адрес
zh_hans: 请填写 Url

# AddBatchRoutingRulesYesNo
source: Do you want to append rules? Choose yes to append, no to replace.
fa_ir: آآیا می خواهید قوانین را اضافه کنید؟ بله برای افزودن، نه برای جایگزینی را انتخاب کنید.
fr: Ajouter les règles ? Choisir "Oui" pour ajouter, "Non" pour tout remplacer.
hu: Hozzá szeretne fűzni szabályokat? Igen a hozzáfűzéshez, nem a cseréhez.
ru: Хотите добавить правила? Выберите «Да» для добавления или «Нет» для замены
zh_hans: 是否追加规则？选择"是"则追加，选择"否"则全部替换。

# MsgDownloadGeoFileSuccessfully
source: Downloaded GeoFile: {0} successfully
fa_ir: GeoFile بارگیری شد: {0} با موفقیت
fr: Téléchargement du fichier Geo : {0} réussi
hu: A GeoFile: {0} sikeresen letöltve
ru: Загрузка GeoFile {0} прошла успешно
zh_hans: 下载 GeoFile：{0} 成功

# LvCustomIcon
source: Custom icon
fa_ir: نماد سفارشی
fr: Icône personnalisée
hu: Egyéni ikon
ru: Пользовательская иконка
zh_hans: 自定义图标

# FillCorrectDNSText
source: Please fill in the correct custom DNS
fa_ir: لطفاً DNS سفارشی صحیح را پر کنید
fr: Veuillez saisir un DNS personnalisé valide
hu: Kérjük, töltse ki a helyes egyéni DNS-t
ru: Введите корректный пользовательский DNS
zh_hans: 请填写正确的自定义 DNS

# TransportPathTip1
source: *ws/http upgrade/xhttp path
fa_ir: * مسیر ws
fr: *chemin ws/httpupgrade/xhttp
hu: *ws/http upgrade/xhttp elérési út
ru: *WebSocket-путь

# TransportPathTip2
source: *h2 path
fa_ir: * مسیر h2
fr: *chemin h2
hu: *h2 elérési út
ru: *HTTP2-путь

# TransportPathTip3
source: *QUIC key/KCP seed
fr: *clé de chiffrement QUIC
hu: *QUIC kulcs/KCP seed
ru: *QUIC-ключ / KCP-seed
zh_hans: *QUIC 加密密钥

# TransportPathTip4
source: *grpc service name
fr: *nom de service gRPC
hu: *grpc szolgáltatásnév
ru: Имя сервиса *gRPC

# TransportRequestHostTip1
source: *http host separated by commas (,)
fa_ir: *هاست http جدا شده با کاما (،)
fr: *hôte http, séparés par des virgules (,)
hu: *http host vesszővel elválasztva (,)
ru: *http-хосты, разделённые запятыми (,)
zh_hans: *http host 中间逗号 (,) 分隔

# TransportRequestHostTip2
source: *ws/http upgrade/xhttp host
fa_ir: *هاست ws
fr: *hôte ws/httpupgrade/xhttp
ru: *WebSocket-хост

# TransportRequestHostTip3
source: *h2 host separated by commas (,)
fa_ir: *هاست h2 با کاما (،) جدا شده است
fr: *hôte h2, séparés par des virgules (,)
hu: *h2 host vesszővel elválasztva (,)
ru: *HTTP2-хосты, разделённые запятыми (,)
zh_hans: *h2 host 中间逗号 (,) 分隔

# TransportRequestHostTip4
source: *QUIC security
fa_ir: *QUIC securty
fr: *méthode de chiffrement QUIC
hu: *QUIC biztonság
ru: Безопасность *QUIC
zh_hans: *QUIC 加密方式

# TransportHeaderTypeTip1
source: *tcp camouflage type
fr: *type de camouflage tcp
hu: *tcp álcázási típus
ru: Тип *TCP-камуфляжа
zh_hans: *tcp 伪装类型

# TransportHeaderTypeTip2
source: *kcp camouflage type
fr: *type de camouflage kcp
hu: *kcp álcázási típus
ru: Тип *KCP-камуфляжа
zh_hans: *kcp 伪装类型

# TransportHeaderTypeTip3
source: *QUIC camouflage type
fr: *type de camouflage QUIC
hu: *QUIC álcázási típus
ru: Тип *QUIC-камуфляжа
zh_hans: *QUIC 伪装类型

# TransportHeaderTypeTip4
source: *grpc mode
fa_ir: *حالت grpc
fr: *mode gRPC
hu: *grpc mód
ru: Режим *gRPC
zh_hans: *grpc 模式

# TransportPathTip5
source: *kcp seed
fr: *graine Kcp

# RegisterGlobalHotkeyFailed
source: Global hotkey {0} registration failed, reason: {1}
fa_ir: ثبت کلید جهانی {0} انجام نشد، دلیل: {1}
fr: Échec de l’enregistrement du raccourci global {0}, raison : {1}
hu: Globális gyorsbillentyű {0} regisztrációja sikertelen, ok: {1}
ru: Не удалось зарегистрировать глобальную горячую клавишу {0}, причина: {1}
zh_hans: 注册全局热键 {0} 失败，原因：{1}

# RegisterGlobalHotkeySuccessfully
source: Global hotkey {0} registered successfully
fa_ir: کلید میانبر جهانی {0} با موفقیت ثبت شد
fr: Raccourci global {0} enregistré avec succès
hu: Globális gyorsbillentyű {0} sikeresen regisztrálva
ru: Глобальная горячая клавиша {0} зарегистрирована успешно
zh_hans: 注册全局热键 {0} 成功

# AllGroupServers
source: All
fa_ir: همه سرورها
fr: Tous
hu: Összes
ru: Все серверы
zh_hans: 所有

# FillServerAddressCustom
source: Please browse to import Configuration configuration
fa_ir: لطفاً برای وارد کردن پیکربندی سرور مرور کنید
fr: Parcourir pour importer la configuration
hu: Kérjük, tallózzon a konfiguráció importálásához
ru: Выберите файл конфигурации сервера для импорта
zh_hans: 请浏览导入配置文件配置

# Speedtesting
source: Testing...
fa_ir: درحال تست کردن...
fr: Test en cours...
hu: Tesztelés...
ru: Тестирование...
zh_hans: 测试中...

# LabLAN
source: LAN
fa_ir: شبکه محلی
fr: Réseau local (LAN)
zh_hans: 局域网

# MsgServerTitle
source: Configuration filter, press Enter to execute
fa_ir: فیلتر سرورها
fr: Filtre : Entrée pour exécuter
hu: Konfigurációs szűrő, Enter billentyűvel végrehajtható
ru: Фильтр серверов
zh_hans: 配置文件过滤器，按回车执行

# menuCheckUpdate
source: Check Update
fa_ir: بررسی بروزرسانی
fr: Rechercher mises à jour
hu: Frissítés ellenőrzése
ru: Проверить обновления
zh_hans: 检查更新

# menuClose
source: Close
fa_ir: بستن
fr: Fermer
hu: Bezárás
ru: Закрыть
zh_hans: 关闭

# menuExit
source: Exit
fa_ir: خروج
fr: Quitter
hu: Kilépés
ru: Выход
zh_hans: 退出

# menuGlobalHotkeySetting
source: Global Hotkey Setting
fa_ir: تنظیم کلید میانبر کلی
fr: Paramètres des raccourcis globaux
hu: Globális gyorsbillentyű beállítás
ru: Глобальная настройка горячих клавиш
zh_hans: 全局热键设置

# menuHelp
source: Help
fa_ir: کمک
fr: Aide
hu: Súgó
ru: Помощь
zh_hans: 帮助

# menuOptionSetting
source: Option Setting
fa_ir: تنظیمات پارامتر
fr: Paramètres config
hu: Opció beállítás
ru: Настройка параметров
zh_hans: 参数设置

# menuReload
source: Reload
fa_ir: بارگذاری مجدد
fr: Redémarrer
hu: Újratöltés
ru: Перезагрузка
zh_hans: 重启服务

# menuRoutingSetting
source: Routing Setting
fa_ir: تنظیم مسیریابی
fr: Paramètres de routage
hu: Útválasztási beállítás
ru: Настройки маршрутизации
zh_hans: 路由设置

# menuServers
source: Configurations
fa_ir: سرورها
fr: Fichiers de config
hu: Konfigurációk
ru: Серверы
zh_hans: 配置文件

# menuSetting
source: Settings
fa_ir: تنظیمات
fr: Paramètres
hu: Beállítások
ru: Настройки
zh_hans: 设置

# menuSubGroupUpdate
source: Update current subscription without proxy
fa_ir: اشتراک فعلی را بدون پروکسی به روز شود
fr: Mettre à jour l’abonnement actuel (sans proxy)
hu: Aktuális előfizetés frissítése proxy nélkül
ru: Обновить текущую подписку без прокси
zh_hans: 更新当前订阅 (不通过代理)

# menuSubGroupUpdateViaProxy
source: Update current subscription with proxy
fa_ir: اشتراک فعلی را با پروکسی به روز شود
fr: Mettre à jour l’abonnement actuel (via le proxy)
hu: Aktuális előfizetés frissítése proxyval
ru: Обновить подписку через прокси
zh_hans: 更新当前订阅 (通过代理)

# menuSubscription
source: Subscription Group
fa_ir: گروه اشتراک
fr: Groupe abonnements
hu: Előfizetési csoport
ru: Группа подписки
zh_hans: 订阅分组

# menuSubSetting
source: Subscription group settings
fa_ir: تنظیم گروه اشتراک
fr: Paramètres des groupes d’abonnement
hu: Előfizetési csoport beállításai
ru: Настройки группы подписки
zh_hans: 订阅分组设置

# menuSubUpdate
source: Update subscriptions without proxy
fa_ir: اشتراک را بدون پروکسی به روز شود
fr: Mettre à jour tous les abonnements (sans proxy)
hu: Előfizetések frissítése proxy nélkül
ru: Обновить подписку без прокси
zh_hans: 更新全部订阅 (不通过代理)

# menuSubUpdateViaProxy
source: Update subscriptions with proxy
fa_ir: اشتراک را با پروکسی به روز شود
fr: Mettre à jour tous les abonnements (via le proxy)
hu: Előfizetések frissítése proxyval
ru: Обновить подписку с прокси
zh_hans: 更新全部订阅 (通过代理)

# menuSystemproxy
source: System proxy
fa_ir: پروکسی سیستم
fr: Proxy système
hu: Rendszerproxy
ru: Системный прокси
zh_hans: 系统代理

# menuSystemProxyClear
source: Clear system proxy
fa_ir: پاک کردن پروکسی سیستم
fr: Effacer le proxy système
hu: Rendszerproxy törlése
ru: Очистить системный прокси
zh_hans: 清除系统代理
