Repository: 2dust/v2rayN
Catalog: v2rayN/v2rayN/Forms/AddServerForm.*.resx
Languages: id

# $this.Text
source: Edit or add a [VMess] server
id: Ubah / tambah server [VMess]

# btnClose.Text
source: &Cancel
id: &Batal

# btnGUID.Text
source: &Generate
id: &Hasilkan

# label1.Text
source: IP地址:
id: Alamat

# label10.Text
source: CamouflageDomain:
id: Enkripsi

# label11.Text
source: CamouflageType:
id: *Rekomendasi (none)

# label12.Text
source: *tcp or kcp or QUIC camouflage type, default none
id: Kata sandi

# label14.Text
source: 1.http host Separated by commas (,)
id: Flow

# label15.Text
source: TLS:
id: Kata sandi

# label16.Text
source: 1.ws path
id: Enkripsi

# label17.Text
source: 2.ws host
id: User(Opsional)

# label18.Text
source: 2.h2 path
id: Kata sandi(Opsional)

# label3.Text
source: UUID:
id: UUID(id)

# label5.Text
source: EncryptionMethod:
id: Metode enkripsi (kemananan)

# label6.Text
source: Alias:
id: Alias (Komentar)

# label7.Text
source: TransportProtocol:
id: UUID(id)

# label8.Text
source: *Recommended (auto)
id: *Rekomendasi (auto)

# label9.Text
source: *Default value tcp
id: Flow
