Repository: 2dust/v2rayN
Catalog: v2rayN/v2rayN/Forms/MainForm.*.resx
Languages: fa_ir

# menuAddVmessServer.Text
source: Add [VMess] server
fa_ir: اضافه کردن به[VMess]سرور

# menuAddVlessServer.Text
source: Add [VLESS] server
fa_ir: اضافه کردن به[VLESS]سرور

# menuAddShadowsocksServer.Text
source: Add [Shadowsocks] server
fa_ir: اضافه کردن به[Shadowsocks]سرور

# menuAddSocksServer.Text
source: Add [Socks] server
fa_ir: اضافه کردن به[Socks]سرور

# menuAddTrojanServer.Text
source: Add [Trojan] server
fa_ir: اضافه کردن به[Trojan]سرور

# menuAddCustomServer.Text
source: Add a custom configuration server
fa_ir: یک سرور پیکربندی سفارشی اضافه کنید

# menuAddServers.Text
source: Import bulk URL from clipboard (Ctrl+V)
fa_ir: واردات انبوه از کلیپ بوردURL (Ctrl+V)

# menuScanScreen.Text
source: Scan QR code on the screen (Ctrl+S)
fa_ir: کد QR را روی صفحه اسکن کنید (Ctrl+S)

# menuRemoveServer.Text
source: Remove selected servers (Delete)
fa_ir: کد QR را روی صفحه اسکن کنید(چند گزینه ای) (Delete)

# menuRemoveDuplicateServer.Text
source: Remove duplicate servers
fa_ir: سرورهای تکراری را حذف کنید

# menuCopyServer.Text
source: Clone selected server
fa_ir: سرور انتخاب شده را شبیه سازی کنید

# menuSetDefaultServer.Text
source: Set as active server (Enter)
fa_ir: به عنوان سرور فعال تنظیم شود (Enter)

# menuMoveTop.Text
source: Move to top (T)
fa_ir: به بالا حرکت کنید (T)

# menuMoveUp.Text
source: Up (U)
fa_ir: حرکت به بالا (U)

# menuMoveDown.Text
source: Down (D)
fa_ir: حرکت به پایین (D)

# menuMoveBottom.Text
source: Move to bottom (B)
fa_ir: به پایین حرکت کنید (B)

# menuSelectAll.Text
source: Select All (Ctrl+A)
fa_ir: انتخاب همه (Ctrl+A)

# menuPingServer.Text
source: Test servers ping (Ctrl+P)
fa_ir: تست تأخیر سرورPing(چند گزینه ای) (Ctrl+P)

# menuTcpingServer.Text
source: Test servers with tcping (Ctrl+O)
fa_ir: تست تأخیر سرورTcping(چند گزینه ای) (Ctrl+O)

# menuRealPingServer.Text
source: Test servers real delay (Ctrl+R)
fa_ir: تست تاخیر اتصال واقعی سرور(چند گزینه ای) (Ctrl+R)

# menuSpeedServer.Text
source: Test servers download speed (Ctrl+T)
fa_ir: تست سرعت سرور(چند گزینه ای) (Ctrl+T)

# tsbTestMe.Text
source: Test current service status
fa_ir: وضعیت سرویس فعلی را تست کنید

# menuExport2ClientConfig.Text
source: Export selected server for client configuration
fa_ir: سرور انتخاب شده را به عنوان پیکربندی کلاینت صادر کنید

# menuExport2ServerConfig.Text
source: Export selected server for server configuration
fa_ir: سرور انتخاب شده را به عنوان پیکربندی سرور صادر کنید

# menuExport2ShareUrl.Text
source: Export share URLs to clipboard (Ctrl+C)
fa_ir: صادر کردن دسته ای و اشتراک گذاری URL ها در کلیپ بورد(چند گزینه ای) (Ctrl+C)

# menuExport2SubContent.Text
source: Export subscription (base64) share to clipboard
fa_ir: صادرات دسته ای محتوای اشتراک به کلیپ بورد(چند گزینه ای)

# tsbServer.Text
source: Servers
fa_ir: سرور

# toolSslServerSpeed.Text
source: SPEED Disabled
fa_ir: نمایش سرعت اینترنت فعال نیست

# menuGlobal.Text
source: Open Http proxy and set the system proxy (global mode)
fa_ir: پروکسی سیستم پیکربندی خودکار

# menuKeepNothing.Text
source: Only open Http proxy and do nothing
fa_ir: پروکسی سیستم را تغییر ندهید

# menuSysAgentMode.Text
source: Http proxy
fa_ir: پروکسی سیستم

# menuServers.Text
source: Server
fa_ir: سرور

# menuAddServers2.Text
source: Import bulk URL from clipboard
fa_ir: URL های انبوه را از کلیپ بورد وارد کنید

# menuScanScreen2.Text
source: Scan QR code on the screen
fa_ir: کد QR را روی صفحه اسکن کنید

# menuUpdateSubscriptions.Text
source: Update subscriptions
fa_ir: اشتراک به روز رسانی(بدون پروکسی)

# menuExit.Text
source: Exit
fa_ir: 退出

# tsbSubSetting.Text
source: Settings
fa_ir: تنظیمات اشتراک

# tsbSubUpdate.Text
source: Updates
fa_ir: اشتراک به روز رسانی(بدون پروکسی)

# tsbSub.Text
source: Subscriptions
fa_ir: 订阅

# tsbQRCodeSwitch.Text
source: Share
fa_ir: 分享

# tsbOptionSetting.Text
source: Settings
fa_ir: تنظیمات پارامتر

# tsbReload.Text
source: Restart service
fa_ir: راه اندازی مجدد سرویس

# tsbCheckUpdateN.Text
source: v2rayN (this software)
fa_ir: v2rayN

# tsbCheckUpdateCore.Text
source: Update v2rayCore
fa_ir: v2fly_v5-Core

# tsbCheckUpdate.Text
source: Check for updates
fa_ir: به روز رسانی را بررسی کنید

# tsbAbout.Text
source: v2rayN Project
fa_ir: v2rayN پروژه

# tsbV2rayWebsite.Text
source: V2Ray Website
fa_ir: V2Ray وب سایت رسمی

# tsbHelp.Text
source: Help
fa_ir: کمک

# tsbPromotion.Text
source: Promotion
fa_ir: 推广

# tsbClose.Text
source: Close
fa_ir: پنجره را ببند
