Repository: 2dust/v2rayN
Catalog: v2rayN/v2rayN/Forms/OptionSettingForm.*.resx
Languages: fa_ir, id

# $this.Text
source: Settings
fa_ir: تنظیمات پارامتر
id: Pengaturan

# btnClose.Text
source: &Cancel
fa_ir: لغو کنید(&C)
id: &Batal

# btnSetLoopback.Text
source: Set Windows10 UWP Loopback
fa_ir: محدودیت های پروکسی Loopback برنامه UWP ویندوز 10 را حذف کنید
id: Atur Windows10 UWP Loopback

# chkAllowLANConn.Text
source: Allow connections from the LAN
fa_ir: اتصالات از LAN را مجاز کنید
id: Izinkan koneksi dari LAN

# chkAutoRun.Text
source: Automatically start at system startup
fa_ir: به طور خودکار در هنگام بوت شروع می شود(ممکن است موفق نباشد)
id: Memulai otomatis saat komputer dinyalakan

# chkEnableAutoAdjustMainLvColWidth.Text
source: Automatically adjust column width after updating subscription
fa_ir: تنظیم خودکار عرض ستون سرور پس از به‌روزرسانی اشتراک
id: Otomatis sesuaikan lebar kolom setelah memperbarui langganan

# chkEnableSecurityProtocolTls13.Text
source: Enable Security Protocol TLS v1.3 (subscription/update/speedtest)
fa_ir: پروتکل امنیتی TLS نسخه 1.3 را فعال کنید (اشتراک، ابونمان/به روز رسانی را بررسی کنید/تست سرعت)
id: Aktifkan Protokol Kemanan TLS v1.3 (langganan/pembaruan/test kecepatan)

# chkEnableStatistics.Text
source: Enable Statistics (Realtime netspeed and traffic records. Require restart)
fa_ir: فعال کردن آمار(نمایش زمان واقعی سرعت شبکه و نمایش مصرف ترافیک，نیاز به راه اندازی مجدد)
id: Aktifkan Statistik (Kecepatan dan catatan arus internet. Perlu memulai ulang)

# chkIgnoreGeoUpdateCore.Text
source: Ignore Geo files when updating core
fa_ir: هنگام به‌روزرسانی Core، فایل‌های Geo را نادیده بگیرید
id: Abaikan file Geo saat memperbarui core

# chkKcpcongestion.Text
source: congestion
id: kongesti

# chkKeepOlderDedupl.Text
source: Keep older when deduplication
fa_ir: هنگام کپی برداری، موارد با شماره دنباله کوچکتر را نگه دارید
id: Simpan yang lama saat deduplikasi

# chklogEnabled.Text
source: Record local logs
fa_ir: ثبت گزارش محلی(به طور پیش فرض خاموش است)
id: Simpan log lokal

# chkmuxEnabled.Text
source: Turn on Mux Multiplexing
fa_ir: Multiplexing Mux را روشن کنید
id: Aktifkan Mux Multiplexing

# chksniffingEnabled.Text
source: Turn on Sniffing
fa_ir: تشخیص ترافیک را روشن کنید
id: Aktifkan Sniffing

# chkudpEnabled.Text
source: Enable UDP
fa_ir: UDP را فعال کنید
id: Aktifkan UDP

# labCoreType1.Text
source: Core Type
id: Tipe Core

# labCoreType2.Text
source: Core Type
id: Tipe Core

# labCoreType3.Text
source: Core Type
id: Tipe Core

# labCoreType4.Text
source: Core Type
id: Tipe Core

# labCoreType5.Text
source: Core Type
id: Tipe Core

# labCoreType6.Text
source: Core Type
id: Tipe Core

# label1.Text
source: protocol
fa_ir: پروتکل
id: protokol

# label12.Text
source: Do not use proxy server for addresses beginning with
fa_ir: برای آدرس هایی که با آن شروع می شوند از سرور پروکسی استفاده نکنید:
id: Jangan gunakan server proxy untuk alamat yang dimulai dengan

# label13.Text
source: Use semicolon (;)
fa_ir: از نقطه ویرگول استفاده کنید(;)جداگانه، مجزا
id: Gunakan titik koma (;)

# label14.Text
source: Custom DNS (multiple, separated by commas (,))
fa_ir: فرمت DNS سفارشی(چندگانه,با کاما(,)جدا از هم)
id: DNS khusus (lebih dari 1, dipisahkan dengan koma (,))

# label15.Text
source: Automatic update interval of and Geo (hours)
fa_ir: فاصله زمانی فایل Geo را به‌طور خودکار به‌روزرسانی کنید(واحد ساعت)
id: Interval pembaruan otomatis dan Geo (jam)

# label17.Text
source: Tray right-click menu servers display limit
fa_ir: با کلیک راست در منو سرور محدودیت تعداد نمایش دهید
id: Klik kanan baki untuk menampilkan batas server

# label18.Text
source: Advanced proxy settings, protocol selection (optional)
fa_ir: تنظیمات پیشرفته پروکسی, انتخاب پروتکل(اختیاری)
id: Pengaturan proxy lanjutan, pilihan protokol (opsional)

# label3.Text
source: Automatic update interval of subscriptions (hours)
fa_ir: تمدید خودکار فاصله اشتراک(واحد ساعت)
id: Interval pembaruan otomatis langganan (jam)

# label8.Text
source: downlinkCapacity
id: Kapasitas downlink

# label9.Text
source: uplinkCapacity
id: Kapasitas uplink

# linkDnsObjectDoc.Text
source: Support DnsObject
fa_ir: پشتیبانی برای پر کردنDnsObject,JSONقالب
id: Dukungan objek DNS

# tabPage1.Text
source: Core: basic settings
fa_ir: Core:تنظیمات پایه
id: Core: Pengaturan dasar

# tabPage2.Text
source: Core: DNS settings
fa_ir: Core:DNSبرپایی
id: Core: Pengaturan DNS

# tabPage3.Text
source: System proxy settings
fa_ir: تنظیمات پراکسی سیستم
id: Pengaturan proxy sistem

# tabPage6.Text
source: Core: KCP settings
fa_ir: Core:KCPبرپایی
id: Core: Pengaturan KCP

# tabPage7.Text
source: v2rayN settings
fa_ir: v2rayNبرپایی
id: Pengaturan v2rayN

# tabPageCoreType.Text
source: CoreType settings
fa_ir: تنظیم نوع core
id: Pengaturan Tipe Core

# label16.Text
source: Auth pass
fa_ir: 认رمز احراز هویت证密码

# label4.Text
source: Auth user
fa_ir: نام کاربری احراز هویت

# chkdefAllowInsecure.Text
source: allowInsecure
fa_ir: هنگامی که tls برای امنیت لایه انتقال انتخاب شده است，تأیید گواهی به طور پیش فرض نادیده گرفته می شود(allowInsecure)

# label5.Text
source: Log level
fa_ir: سطح گزارش

# label2.Text
source: Listening port
fa_ir: پورت گوش دادن محلی

# lbFreshrate.Text
source: Statistics freshrate (second)
fa_ir: نرخ تازه سازی آمار(در چند ثانیه)

# groupBox2.Text
source: Exception
fa_ir: استثنا

# btnOK.Text
source: &OK
fa_ir: مطمئن(&O)
