Repository: 2dust/v2rayN
Catalog: v2rayN/v2rayN/Resx/ResUI.*.resx
Languages: id, ru, zh_hant

# BatchExportSubscriptionSuccessfully
source: Batch export subscription to clipboard successfully
id: Ekspor kumpulan langganan ke papan klip berhasil
ru: Экспортирование подписок в буфер обмена успешно завершено
zh_hant: 批次匯出訂閱內容至剪貼簿成功

# BatchExportURLSuccessfully
source: Batch export share URL to clipboard successfully
id: Ekspor kumpulan URL ke papan klip berhasil
ru: Экспортирование URL в буфер обмена успешно завершено
zh_hant: 批次匯出分享URL至剪貼簿成功

# CheckServerSettings
source: Please check the server settings first
id: Harap cek pengaturan server
ru: Пожалуйста, сначала проверьте настройки сервера
zh_hant: 請先檢查伺服器設定

# ConfigurationFormatIncorrect
source: Invalid configuration format
id: Format konfigurasi salah
ru: Недопустимый формат конфигурации
zh_hant: 配置格式不正確

# CustomServerTips
source: Note that custom configuration relies entirely on your own configuration and does not work with all settings. If you want to use the system proxy, please modify the listening port manually.
id: Perhatian, konfigurasi khusus bergantung pada konfigurasi anda sendiri dan tidak berfungsi dengan semua pengaturan. Jika anda ingin menggunakan proksi sistem, harap mengubah listening port secara manual.
ru: Обратите внимание, что пользовательская конфигурация полностью зависит от вашей собственной конфигурации и работает не со всеми настройками. Если вы хотите использовать системный прокси, пожалуйста, измените порт прослушивания вручную.
zh_hant: 注意，自訂配置完全依賴您自己的配置，不能使用所有設定功能。如需使用系統代理請手動修改監聽埠。

source: Downloading...
id: Mengunduh...
ru: Загрузка...
zh_hant: 下載開始...

# downloadSpeed
source: Download
id: Mengunduh
ru: Скорость загрузки
zh_hant: 下載

# DownloadYesNo
source: Whether to download? {0}
id: Yakin untuk mengunduh? {0}
ru: Хотите загрузить? {0}
zh_hant: 是否下載? {0}

# FailedConversionConfiguration
source: Failed to convert configuration file
id: Gagal mengubah file konfigurasi
ru: Не удалось преобразовать файл конфигурации
zh_hant: 轉換配置檔案失敗

# FailedGenDefaultConfiguration
source: Failed to generate default configuration file
id: Gagal menghasilkan file konfigurasi bawaan
ru: Не удалось создать файл конфигурации по умолчаниюe
zh_hant: 生成預設配置檔案失敗

# FailedGetDefaultConfiguration
source: Failed to get the default configuration
id: Gagal mendapatkan konfigurasi bawaan
ru: Не удалось получить конфигурацию по умолчанию
zh_hant: 獲取預設配置失敗

# FailedImportedCustomServer
source: Failed to import custom configuration server
id: Gagal mengimpor konfigurasi khusus server
ru: Не удалось импортировать сервер пользовательской конфигурации
zh_hant: 匯入自訂配置伺服器失敗

# FailedReadConfiguration
source: Failed to read configuration file
id: Gagal membaca file konfigurasi
ru: Не удалось прочитать файл конфигурации
zh_hant: 讀取配置檔案失敗

# FillCorrectServerPort
source: Please fill in the correct format server port
id: Harap mengisi format port server dengan benar
ru: Пожалуйста, укажите порт сервера в правильном формате
zh_hant: 請填寫正確格式伺服器埠

# FillKcpParameters
source: Please fill in the KCP parameters correctly
id: Harap mengisi parameter KCP dengan benar
ru: Пожалуйста, заполните параметры KCP корректно
zh_hant: 請正確填寫KCP參數

# FillLocalListeningPort
source: Please fill in the local listening port
id: Harap mengisi listening port lokal
ru: Пожалуйста, укажите локальный порт прослушивания
zh_hant: 請填寫本機監聽埠

# FillPassword
source: Please fill in the password
id: Harap mengisi kata sandi
ru: Пожалуйста, введите пароль
zh_hant: 請填寫密碼

# FillServerAddress
source: Please fill in the server address
id: Harap mengisi alamat server
ru: Пожалуйста, заполните адрес сервера
zh_hant: 請填寫伺服器位址

# FillUUID
source: Please fill in the user ID
id: Harap mengisi user ID
ru: Пожалуйста, заполните идентификатор пользователя
zh_hant: 請填寫使用者ID

# IncorrectClientConfiguration
source: is not the correct client configuration file, please check
id: bukan file konfigurasi klien yang benar, harap periksa
ru: Некорректный файл конфигурации клиента, пожалуйста, проверьте
zh_hant: 不是正確的用戶端配置檔案，請檢查

# Incorrectconfiguration
source: is not the correct configuration, please check
id: bukan konfigurasi yang benar, silakan periksa
ru: Некорректная конфигурация, пожалуйста, проверьте
zh_hant: 不是正確的配置，請檢查

# IncorrectServerConfiguration
source: is not the correct server configuration file, please check
id: bukan file konfigurasi server yang benar, harap periksa
ru: Некорректный файл конфигурации сервера, пожалуйста, проверьте
zh_hant: 不是正確的服務端配置檔案，請檢查

source: Initial Configuration
id: Konfigurasi awal
ru: Исходная конфигурация
zh_hant: 初始化配置

# IsLatestCore
source: {0} already up to date.
id: {0} paling terbaru.
ru: {0} {1} является последней версией.
zh_hant: {0} {1} 已是最新版本。

# IsLatestN
source: {0} already up to date.
id: {0} paling terbaru.
ru: {0} {1} является последней версией.
zh_hant: {0} {1} 已是最新版本。

# LvAddress
source: Address
id: Alamat
ru: Адрес
zh_hant: 位址

# LvEncryptionMethod
source: Security
id: Kemananan
ru: Безопасность
zh_hant: 加密方式

# LvPort
source: Port
ru: Порт
zh_hant: 埠

# LvServiceType
source: Type
id: Tipe
ru: Тип
zh_hant: 類型

# LvSubscription
source: Subs group
id: Subs
ru: Группа подписки
zh_hant: 訂閱分組

# LvTodayDownloadDataAmount
source: Download traffic today
id: Arus unduhan hari ini
ru: Загружено трафика сегодня
zh_hant: 今日下載

# LvTodayUploadDataAmount
source: Upload traffic today
id: Arus unggahan hari ini
ru: Отдано трафика сегодня
zh_hant: 今日上傳

# LvTotalDownloadDataAmount
source: Total download traffic
id: Total arus unduhan
ru: Всего загружено
zh_hant: 總下載

# LvTotalUploadDataAmount
source: Total upload traffic
id: Total arus unggahan
ru: Всего отдано
zh_hant: 總上傳

# LvTransportProtocol
source: Transport
ru: Протокол
zh_hant: 傳輸協定

# MsgClearSubscription
source: Clear original subscription content
id: Bersihkan isi langganan yang asli
ru: Очистить контент оригинальной подписки
zh_hant: 清除原訂閱內容

# MsgDownloadV2rayCoreSuccessfully
source: Download Core successfully
id: Berhasil mengunduh Core
ru: Ядро успешно загружено
zh_hant: 下載Core成功

# MsgFailedImportSubscription
source: Failed to import subscription content
id: Gagal mengimpor isi langganan
ru: Не удалось импортировать содержимое подписки
zh_hant: 匯入訂閱內容失敗

# MsgGetSubscriptionSuccessfully
source: Get subscription content successfully
id: Berhasil mendapatkan isi langganan
ru: Содержимое подписки успешно импортировано
zh_hant: 獲取訂閱內容成功

# MsgNoValidSubscription
source: No valid subscriptions set
id: Tidak ada set langganan yang valid
ru: Нет установлены подписки
zh_hant: 未設定有效的訂閱

# MsgParsingSuccessfully
source: Resolve {0} successfully
id: {0} selesai & sukses
ru: Парсинг {0} прошел успешно
zh_hant: 解析{0}成功

# MsgStartGettingSubscriptions
source: Start getting subscriptions
id: Memulai mendapatkan langganan
ru: Начинаю получать подписки
zh_hant: 開始獲取訂閱內容

# MsgStartUpdating
source: Start updating {0}...
id: Memulai pembaruan {0}...
ru: Начинаю обновление {0}...
zh_hant: 開始更新 {0}...

# MsgSubscriptionDecodingFailed
source: Invalid subscription content
id: Isi langganan tidak valid
ru: Некорректное содержимое подписки
zh_hant: 無效的訂閱內容

# MsgUnpacking
source: is unpacking...
id: sedang membongkar...
ru: распаковывается...
zh_hant: 正在解壓......

# MsgUpdateSubscriptionEnd
source: Update subscription end
id: Pembaruan langganan berakhir
ru: Обновление подписки закончено
zh_hant: 更新訂閱結束

# MsgUpdateSubscriptionStart
source: Update subscription starts
id: Pembaruan langganan dimulai
ru: Обновление подписки начинается
zh_hant: 更新訂閱開始

# MsgUpdateV2rayCoreSuccessfully
source: Update Core successfully
id: Berhasil memperbarui Core
ru: Успешное обновление ядра
zh_hant: 更新Core成功

# MsgUpdateV2rayCoreSuccessfullyMore
source: Update Core successfully! Restarting service...
id: Berhasil memperbarui Core! Memulai ulang layanan...
ru: Успешное обновление ядра! Перезапуск службы...
zh_hant: 更新Core成功！正在重啟服務...

source: Non-VMess or ss protocol
ru: Не является протоколом Vmess или SS
zh_hant: 非VMess或SS協定

# NonVmessService
source: non-standard service, this feature is invalid
id: layanan non-standar, fitur ini tidak valid
ru: нестандартный сервис, эта функция недействительна
zh_hant: 非標準服務，此功能無效

# NotFoundCore
source: The Core file (file name: {1}) was not found under the folder ({0}), please download and put it in the folder, download address: {2}
id: Tidak ditemukan Core({0}), harap mengunduh: {1}
ru: Файл Core (имя файла: {1}) не найден в папке ({0}), загрузите и поместите его в папку, адрес загрузки: {2}
zh_hant: 在資料夾 ({0}) 下未找到Core文件 (檔案名:{1})，請下載後放入資料夾、，下載網址: {2}

# NoValidQRcodeFound
source: Scan completed, no valid QR code found
id: Pemindaian selesai, tidak ditemukan kode QR yang valid
ru: Сканирование завершено, не найден корректный QR код
zh_hant: 掃描完成,未發現有效二維碼

# OperationFailed
source: operation failed, please check and retry
ru: операция безуспешна, проверьте и попробуйте ещё раз
zh_hant: 操作失敗，請檢查重試

source: Please Fill Remarks
ru: Пожалуйста, заполните примечания
zh_hant: 請填寫別名

# PleaseSelectEncryption
source: Please select the encryption method
id: Harap pilih metode enkripsi
ru: Пожалуйста, выберите метод шифрования
zh_hant: 請選擇加密方式

# PleaseSelectProtocol
source: Please select a protocol
id: Harap pilih protokol
ru: Пожалуйста, выберите протокол
zh_hant: 請選擇協定

# PleaseSelectServer
source: Please select the server first
id: Harap pilih server
ru: Сначала выберите сервер
zh_hant: 請先選擇伺服器

# RemoveDuplicateServerResult
source: Servers deduplication completed. Old: {0}, New: {1}.
ru: Удаление дублей завершено. Старая: {0}, Новая: {1}.
zh_hant: 伺服器去重完成。原數量: {0}，現數量: {1}

# RemoveServer
source: Are you sure to remove the server?
id: Yakin untuk menghapus server?
ru: Вы уверены, что хотите удалить сервер?
zh_hant: 是否確定移除伺服器?

# SaveClientConfigurationIn
source: The client configuration file is saved at: {0}
ru: Файл конфигурации клиента сохранен по адресу: {0}
zh_hant: 用戶端配置檔案儲存在:{0}

# StartService
source: Start service ({0})...
ru: Запуск сервиса ({0})...
zh_hant: 啟動服務({0})...

# SuccessfulConfiguration
source: Configuration successful {0}
id: Konfigurasi berhasil
ru: Конфигурация успешна {0}
zh_hant: 配置成功{0}

# SuccessfullyImportedCustomServer
source: Custom configuration server imported successfully.
ru: Пользовательский сервер конфигурации успешно импортирован.
zh_hant: 成功匯入自訂配置伺服器

# SuccessfullyImportedServerViaClipboard
source: {0} servers have been imported from clipboard.
id: Berhasil mengimpor server {0} dari papan klip.
ru: {0} серверов импортировано из буфера обмена.
zh_hant: 成功從剪貼簿匯入 {0} 個伺服器

# SuccessfullyImportedServerViaScan
source: Scan import URL successfully
id: Berhasil mengimpor URL dari pemindai
ru: Сканирование URL-адреса импорта успешна.
zh_hant: 掃描匯入URL成功

# TestMeOutput
source: The ping of current service: {0} ms
ru: Задержка текущего сервера: {0} мс
zh_hant: 目前服務的真連接延遲: {0} ms

source: Operation success
ru: Операция успешна
zh_hant: 操作成功

source: Please select rules
id: Harap pilih aturan
ru: Выберите правила
zh_hant: 請先選擇規則

# RemoveRules
source: Are you sure to remove the rules?
id: Yakin untuk menghapus aturan?
ru: Вы уверены, что хотите удалить правила?
zh_hant: 是否確定移除規則?

# RoutingRuleDetailRequiredTips
source: {0},One of the required.
ru: {0}, Один из обязательных..
zh_hant: {0},必填其中一項.

# LvRemarks
source: Remarks
id: komentar
ru: Примечания
zh_hant: 別名

# LvUrl
source: Url(Optional)
id: Url
ru: URL (необязательно)
zh_hant: 可選位址(URL)

# LvCount
source: Count
id: Jumlah
ru: Количество
zh_hant: 數量

# MsgNeedUrl
source: Please fill in the Url
id: Harap mengisi alamat (url)
ru: Пожалуйста, заполните адрес (Url)
zh_hant: 請填寫URL

# AddBatchRoutingRulesYesNo
source: Do you want to append rules? Choose yes to append, choose otherwise to replace
id: Tambahkan aturan baru? Pilih ya untuk tambahkan, pilih lainnya untuk mengganti
ru: Вы хотите добавить правила? Выберите «Да», чтобы добавить, выберите иное, чтобы заменить
zh_hant: 是否追加規則?選擇是則追加,選擇否則取代

# MsgDownloadGeoFileSuccessfully
source: Download GeoFile: {0} successfully
id: Berhasil mengunduh GeoFile: {0}
ru: Загрузка GeoFile: {0} успешна
zh_hant: 下載 GeoFile: {0} 成功

# MsgInformationTitle
source: Information
id: Informasi (Filter : {0})
ru: Информация
zh_hant: 資訊

# LvCustomIcon
source: Custom Icon
id: Ikon Khusus
ru: Пользовательская иконка
zh_hant: 自訂圖示

# FillCorrectDNSText
source: Please fill in the correct custom DNS
id: Harap mengisi DNS khusus dengan benar
ru: Пожалуйста, заполните правильный пользовательский DNS
zh_hant: 請填寫正確的自訂DNS

# TransportPathTip1
source: *ws path
ru: *ws путь
zh_hant: *ws/httpupgrade/splithttp path

# TransportPathTip3
source: *QUIC key/Kcp seed
ru: *QUIC ключ/Kcp seed
zh_hant: *QUIC 加密金鑰

# TransportRequestHostTip1
source: *http host Separated by commas (,)
ru: *http хосты разделенные запятыми (,)
zh_hant: *http host中間逗號(,)分隔

# TransportRequestHostTip2
source: *ws host
ru: *ws хост
zh_hant: *ws/httpupgrade/splithttp host

# TransportRequestHostTip3
source: *h2 host Separated by commas (,)
ru: *h2 хосты разделенные запятыми (,)
zh_hant: *h2 host中間逗號(,)分隔

# TransportRequestHostTip4
source: *QUIC security
ru: * безопасность QUIC
zh_hant: *QUIC 加密方式

# TransportHeaderTypeTip1
source: *tcp camouflage type
ru: * тип TCP камуфляжа
zh_hant: *TCP偽裝類型

# TransportHeaderTypeTip2
source: *kcp camouflage type
ru: * тип KCP камуфляжа
zh_hant: *KCP偽裝類型

# TransportHeaderTypeTip3
source: *QUIC camouflage type
ru: * тип QUIC камуфляжа
zh_hant: *QUIC偽裝類型

# TransportHeaderTypeTip4
source: *grpc mode
ru: * режим grpc
zh_hant: *GRPC 模式

# RegisterGlobalHotkeyFailed
source: Global hotkey {0} registered failed, reason {1}
ru: Не удалось зарегистрировать глобальную горячую клавишу {0}, причина: {1}
zh_hant: 註冊全域快速鍵 {0} 失敗,原因 {1}

# RegisterGlobalHotkeySuccessfully
source: Global hotkey {0} registered successfully
ru: Глобальная горячая клавиша {0} зарегистрирована успешно
zh_hant: 註冊全域快速鍵 {0} 成功

# UngroupedServers
source: Ungrouped
ru: Разгруппировано
zh_hant: 未分組伺服器

# AllGroupServers
source: All
id: Semua server
ru: Все сервера
zh_hant: 所有

# FillServerAddressCustom
source: Please browse to import server configuration
id: Silakan telusuri untuk mengimpor konfigurasi server
ru: Пожалуйста, просмотрите, чтобы импортировать конфигурацию сервера
zh_hant: 請瀏覽匯入伺服器配置

source: System proxy
id: Proksi sistem
ru: Системный прокси
zh_hant: 系統代理

# Speedtesting
source: Testing...
id: Tes Kecepatan...
ru: Тестирование...
zh_hant: 測試中...

# TooManyServersTip
source: Too many servers, please open the main interface
id: Terlalu banyak server, harap buka antarmuka utama
ru: Слишком много серверов, пожалуйста, откройте главный интерфейс
zh_hant: 伺服器太多，請打開主介面操作

# LabLAN
source: LAN
zh_hant: 區域網路

# LabLocal
source: Local
id: Lokal
ru: Локальный
zh_hant: 本機

# MsgServerTitle
source: Servers Filter, press Enter to execute
id: Server (Filter : {0})
ru: Фильтр серверов
zh_hant: 伺服器過濾器，按Enter執行

# menuCheckUpdate
source: Check Update
ru: Проверить обновления
zh_hant: 檢查更新

# menuClose
source: Close
ru: Закрыть
zh_hant: 關閉

# menuExit
source: Exit
ru: Выход
zh_hant: 退出

# menuGlobalHotkeySetting
source: GlobalHotkeySetting
ru: Глобальная настройка горячих клавиш
zh_hant: 全域快速鍵設定

# menuHelp
source: Help
ru: Помощь
zh_hant: 說明

# menuOptionSetting
source: OptionSetting
ru: Настройка параметров
zh_hant: 參數設定

# menuPromotion
source: Promotion
ru: Содействие
zh_hant: 推廣

# menuReload
source: Reload
ru: Перезагрузка
zh_hant: 重啟服務

# menuRoutingSetting
source: RoutingSetting
ru: Настройки маршрутизации
zh_hant: 路由設定

# menuServers
source: Servers
ru: Сервера
zh_hant: 伺服器

# menuSetting
source: Settings
ru: Настройки
zh_hant: 設定

# menuSubGroupUpdate
source: Update current subscription without proxy
ru: Обновить текущую подписку без прокси
zh_hant: 更新目前訂閱(不透過代理)

# menuSubGroupUpdateViaProxy
source: Update current subscription with proxy
ru: Обновить текущую подписку с прокси
zh_hant: 更新目前訂閱(透過代理)

# menuSubscription
source: Subscription group
ru: Группа подписки
zh_hant: 訂閱分組

# menuSubSetting
source: Subscription group Settings
ru: Настройки группы подписки
zh_hant: 訂閱分組設定

# menuSubUpdate
source: Update subscription without proxy
ru: Обновить подписку без прокси
zh_hant: 更新全部訂閱(不透過代理)

# menuSubUpdateViaProxy
source: Update subscription with proxy
ru: Обновить подписку с прокси
zh_hant: 更新全部訂閱(透過代理)

# menuSystemproxy
source: System proxy
ru: Системный прокси
zh_hant: 系統代理

# menuSystemProxyClear
source: Clear system proxy
ru: Очистить системный прокси
zh_hant: 清除系統代理

# menuSystemProxyNothing
source: Do not change system proxy
ru: Не менять системный прокси
zh_hant: 不改變系統代理

# menuSystemProxyPac
source: Pac Mode
ru: Режим PAC
zh_hant: PAC模式

# menuSystemProxySet
source: Set system proxy
ru: Установить системный прокси
zh_hant: 自動配置系統代理

# TbSettingsColor
source: Color
ru: Цвет
zh_hant: 顏色

# TbSettingsColorMode
source: Dark Mode
ru: Тёмный режим
zh_hant: 暗黑模式

# TbSettingsFollowSystemTheme
source: Follow System Theme
ru: Следить за системной темой
zh_hant: 是否跟隨系統主題

# TbSettingsLanguage
source: Language(Restart)
ru: Язык (требуется перезапуск)
zh_hant: 語言(重啟)

# menuAddServerViaClipboard
source: Import bulk URL from clipboard (Ctrl+V)
ru: Импорт массива URL из буфера обмена (Ctrl+V)
zh_hant: 從剪貼簿匯入批次URL (Ctrl+V)

# menuAddServerViaScan
source: Scan QR code on the screen (Ctrl+S)
ru: Сканировать QR-код с экрана (Ctrl+S)
zh_hant: 掃描螢幕上的二維碼 (Ctrl+S)

# menuCopyServer
source: Clone selected server
ru: Клонировать выбранный сервер
zh_hant: 複製所選伺服器

# menuRemoveDuplicateServer
source: Remove duplicate servers
ru: Удалить дубликаты серверов
zh_hant: 移除重複的伺服器

# menuRemoveServer
source: Remove selected servers (Delete)
ru: Удалить выбранные серверы (Delete)
zh_hant: 移除所選伺服器(多選) (Delete)

# menuSetDefaultServer
source: Set as active server (Enter)
ru: Установить как активный сервер (Enter)
zh_hant: 設為活動伺服器 (Enter)

# menuClearServerStatistics
source: Clear all service statistics
ru: Очистить всю статистику
zh_hant: 清除所有服務統計資料

# menuRealPingServer
source: Test servers real delay (Ctrl+R)
ru: Тест на реальную задержку сервера (Ctrl+R)
zh_hant: 測試伺服器真連接延遲(多選) (Ctrl+R)

# menuSortServerResult
source: Sort by test result
ru: Сортировать по результату теста
zh_hant: 按測試結果排序

# menuSpeedServer
source: Test servers download speed (Ctrl+T)
ru: Тест на скорость загрузки сервера (Ctrl+T)
zh_hant: 測試伺服器速度(多選) (Ctrl+T)

# menuTcpingServer
source: Test servers with tcping (Ctrl+O)
ru: Тест задержки с tcping (Ctrl+O)
zh_hant: 測試伺服器延遲Tcping(多選) (Ctrl+O)

# menuTestMe
source: Test current service status
ru: Проверить текущий статус службы
zh_hant: 測試目前服務狀態

# menuExport2ClientConfig
source: Export selected server for client configuration
ru: Экспортировать выбранный сервер для клиента
zh_hant: 匯出所選伺服器為用戶端配置

# menuExport2ShareUrl
source: Export share URLs to clipboard (Ctrl+C)
ru: Экспорт URL-адресов общего доступа в буфер обмена (Ctrl+C)
zh_hant: 批次匯出分享URL至剪貼簿(多選) (Ctrl+C)

# menuExport2SubContent
source: Export subscription (base64) share to clipboard
ru: Экспортировать ссылку-подписку (base64) в буфер обмена
zh_hant: 批次匯出訂閱內容至剪貼簿(多選)

# menuAddCustomServer
source: Add a custom configuration server
ru: Добавить сервер пользовательской конфигурации
zh_hant: 新增自訂配置伺服器

# menuAddShadowsocksServer
source: Add [Shadowsocks] server
ru: Добавить сервер [Shadowsocks]
zh_hant: 新增[Shadowsocks]伺服器

# menuAddSocksServer
source: Add [Socks] server
ru: Добавить сервер [Socks]
zh_hant: 新增[Socks]伺服器

# menuAddTrojanServer
source: Add [Trojan] server
ru: Добавить сервер [Trojan]
zh_hant: 新增[Trojan]伺服器

# menuAddVlessServer
source: Add [VLESS] server
ru: Добавить сервер [VLESS]
zh_hant: 新增[VLESS]伺服器

# menuAddVmessServer
source: Add [VMess] server
ru: Добавить сервер [VMess]
zh_hant: 新增[VMess]伺服器

# menuSelectAll
source: Select All (Ctrl+A)
ru: Выбрать все (Ctrl+A)
zh_hant: 全選 (Ctrl+A)

# menuMsgViewClear
source: Clear All
ru: Очистить все
zh_hant: 清除所有

# menuMsgViewCopy
source: Copy (Ctrl+C)
ru: Скопировать (Ctrl+C)
zh_hant: 複製 (Ctrl+C)

# menuMsgViewCopyAll
source: Copy All
ru: Скопировать все
zh_hant: 複製所有

# menuMsgViewFilter
source: Set message filters
ru: Установить фильтры сообщений
zh_hant: 設定資訊過濾器

# menuMsgViewSelectAll
source: Select All (Ctrl+A)
ru: Выбрать все (Ctrl+A)
zh_hant: 全選 (Ctrl+A)

# menuSubAdd
source: Add
ru: Добавить
zh_hant: 新增

# menuSubDelete
source: Delete
ru: Удалить
zh_hant: 刪除

# menuSubEdit
source: Edit
ru: Редактировать
zh_hant: 編輯

# menuSubShare
source: Share
ru: Поделиться
zh_hant: 分享

# LvEnabled
source: Enabled Update
ru: Включены обновления
zh_hant: 啟用更新

# LvSort
source: Sort
ru: Сортировка
zh_hant: 排序

# LvUserAgent
source: User Agent
zh_hant: User Agent(可選)

# TbCancel
source: Cancel
ru: Отмена
zh_hant: 取消

# TbConfirm
source: Confirm
ru: Подтвердить
zh_hant: 確定

# GbTransport
source: Transport
ru: Транспорт
zh_hant: 底層傳輸方式(transport)

# TbAddress
source: Address
ru: Адрес
zh_hant: 位址(address)

# TbAllowInsecure
source: AllowInsecure
ru: Разрешить небезопасные
zh_hant: 跳過憑證驗證(allowinsecure)

# TbAlterId
source: AlterId
zh_hant: 額外ID(alterid)

# TbHeaderType
source: Camouflage type
ru: Тип камуфляжа
zh_hant: 偽裝類型(type)

# TbId
source: UUID(id)
zh_hant: 使用者ID(id)

# TbNetwork
source: Transport protocol(network)
ru: Транспортный протокол сети
zh_hant: 傳輸協定(network)

# TbPath
source: Path
ru: Путь
zh_hant: 路徑(path)

# TbPort
source: Port
ru: Порт
zh_hant: 埠(port)

# TbRemarks
source: Alias (remarks)
ru: Примечание
zh_hant: 別名(remarks)

# TbRequestHost
source: Camouflage domain(host)
ru: Маскирующий домен (хост)
zh_hant: 偽裝域名(host)

# TbSecurity
source: Encryption method (security)
ru: Метод шифрования
zh_hant: 加密方式(security)

# TbStreamSecurity
source: TLS
zh_hant: 傳輸層安全(TLS)

# TipNetwork
source: *Default value tcp
ru: * По-умолчанию TCP
zh_hant: *預設TCP,選錯會無法連接

# TbCoreType
source: Core Type
ru: Ядро
zh_hant: Core類型

# TbFlow5
source: Flow
ru: Поток
zh_hant: 流控(flow)

# TbGUID
source: Generate
ru: Генерировать
zh_hant: 生成

# TbId3
source: Password
ru: Пароль
zh_hant: 密碼(password)

# TbId4
source: Password(Optional)
ru: Пароль(Необязательно)
zh_hant: 密碼(可選)

# TbId5
source: UUID(id)
zh_hant: 使用者ID(id)

# TbSecurity3
source: Encryption
ru: Шифрование
zh_hant: 加密方式(encryption)

# TbSecurity4
source: User(Optional)
ru: Пользователь(Необязательно)
zh_hant: 使用者名稱(可選)

# TbSecurity5
source: Encryption
ru: Шифрования
zh_hant: 加密方式(encryption)

# TbPreSocksPort
source: txtPreSocksPort
zh_hant: SOCKS埠

# TipPreSocksPort
source: * After setting this value, an socks service will be started using sing-box to provide functions such as speed display
ru: * После установки этого значения служба socks будет запущена с использованием sing-box для обеспечения таких функций, как отображение скорости
zh_hant: * 自訂配置的Socks埠值，可不設定；當設定此值後，將使用Xray/sing-box(Tun)額外啟動一個前置Socks服務，提供分流和速度顯示等功能

# TbBrowse
source: Browse
ru: Просмотр
zh_hant: 瀏覽

# TbEdit
source: Edit
ru: Редактировать
zh_hant: 編輯

# TbSettingsAdvancedProtocol
source: Advanced proxy settings, protocol selection (optional)
ru: Расширенные настройки прокси, выбор протокола (необязательно)
zh_hant: 進階代理設定, 協定選擇(可選)

# TbSettingsAllowLAN
source: Allow connections from the LAN
ru: Разрешить подключения из локальной сети
zh_hant: 允許來自區域網路的連接

# TbSettingsAutoHideStartup
source: Auto hide startup
ru: Автоскрытие при автозапуске
zh_hant: 啟動後隱藏視窗

# TbSettingsAutoUpdateInterval
source: Automatic update interval of Geo (hours)
ru: Интервал автоматического обновления Geo в часах
zh_hant: 自動更新Geo文件的間隔(單位小時)

# TbSettingsCore
source: Core: basic settings
ru: Ядро: базовые настройки
zh_hant: Core: 基礎設定

# TbSettingsCoreDns
source: V2ray DNS settings
ru: Настройки DNS V2ray
zh_hant: V2ray DNS設定

# TbSettingsCoreKcp
source: Core: KCP settings
ru: Ядро: настройки KCP
zh_hant: Core: KCP設定

# TbSettingsCoreType
source: CoreType settings
ru: Настройки типа ядра
zh_hant: Core類型設定
