Repository: 2dust/v2rayN
Catalog: v2rayN/v2rayN/Resx/ResUI.*.resx
Languages: id, ru, zh_hant

# TbSettingsDefAllowInsecure
source: AllowInsecure
ru: Разрешить небезопасные
zh_hant: 預設跳過憑證驗證(allowinsecure)

# TbSettingsEnableAutoAdjustMainLvColWidth
source: Automatically adjust column width after updating subscription
ru: Автоматически регулировать ширину столбца после обновления подписки
zh_hant: 在更新訂閱後自動調整伺服器列寬

# TbSettingsEnableCheckPreReleaseUpdate
source: Check for pre-release updates
ru: Проверить наличие предварительных обновлений
zh_hant: 檢查Pre-Release更新(請謹慎啟用)

# TbSettingsException
source: Exception
ru: Исключение
zh_hant: 例外

# TbSettingsExceptionTip
source: Exception. Do not use proxy server for addresses beginning with,Use semicolon (;)
ru: Исключение. Не используйте прокси-сервер для адресов, начинающихся с (,), используйте точку с запятой (;)
zh_hant: 例外. 對於下列字元開頭的位址不使用代理配置檔案:使用分號(;)分隔

# TbSettingsHttpPort
source: Http Port
ru: HTTP порт
zh_hant: 本機HTTP監聽埠

# TbSettingsIgnoreGeoUpdateCore
source: Ignore Geo files when updating core
ru: Игнорировать файлы Geo при обновлении ядра
zh_hant: 更新Core時忽略Geo檔案

# TbSettingsKeepOlderDedupl
source: Keep older when deduplication
ru: Сохранить старые при удалении дублей
zh_hant: 去重時保留序號較小的項

# TbSettingsLogEnabled
source: Enable Log
ru: Записывать логи
zh_hant: 啟用日誌

# TbSettingsLogLevel
source: Log Level
ru: Уровень логгирования
zh_hant: 日誌等級

# TbSettingsMuxEnabled
source: Turn on Mux Multiplexing
ru: Включите мультиплексирование Mux
zh_hant: 開啟Mux多路復用

# TbSettingsN
source: v2rayN settings
ru: Настройки v2rayN
zh_hant: v2rayN 設定

# TbSettingsPass
source: Auth pass
ru: Пароль аутентификации
zh_hant: 認證密碼

# TbSettingsRemoteDNS
source: Custom DNS (multiple, separated by commas (,))
ru: Пользовательский DNS (если несколько делите с запятыми (,))
zh_hant: 自訂DNS(可多個,用逗號(,)分隔)

# TbSettingsSetUWP
source: Set Win10 UWP Loopback
zh_hant: 解除Win10 UWP應用回環代理限制

# TbSettingsSniffingEnabled
source: Turn on Sniffing
ru: Включить сниффинг
zh_hant: 開啟流量探測

# TbSettingsSocksPort
source: Socks Port
ru: Порт Socks
zh_hant: 本機SOCKS監聽埠

# TbSettingsStartBoot
source: Start on boot
ru: Автозапуск
zh_hant: 開機啟動(可能會不成功)

# TbSettingsStatistics
source: Enable Statistics (Require restart)
ru: Включить статистику (требуется перезагрузка)
zh_hant: 啟用統計(即時網速顯示，需重啟)

# TbSettingsSubConvert
source: Subscription conversion Url
ru: URL-адрес конверсии подписки
zh_hant: 訂閱轉換網址(可選)

# TbSettingsSystemproxy
source: System proxy settings
ru: Настройки системного прокси
zh_hant: 系統代理設定

# TbSettingsTLS13
source: Enable Security Protocol TLS v1.3 (subscription/update)
ru: Включить протокол безопасности TLS v1.3 (обновление подписки)
zh_hant: 啟用安全協定TLS v1.3 (訂閱/檢查更新)

# TbSettingsTrayMenuServersLimit
source: Tray right-click menu servers display limit
ru: Лимит серверов в меню трея
zh_hant: 工具列右鍵選單伺服器展示數量限制

# TbSettingsUdpEnabled
source: Enable UDP
ru: Включить UDP
zh_hant: 開啟UDP

# TbSettingsUser
source: Auth user
zh_hant: 認證使用者名稱

# TbClearSystemProxy
source: Clear system proxy
ru: Очистить системный прокси
zh_hant: 清除系統代理

# TbDisplayGUI
source: Display GUI
ru: Показать GUI
zh_hant: 顯示主介面

# TbGlobalHotkeySetting
source: GlobalHotkey Settings
ru: Настройка горячих клавиш
zh_hant: 全域快速鍵設定

# TbGlobalHotkeySettingTip
source: Set directly by pressing the keyboard, Take effect after restart
ru: Установите непосредственно, нажав на клавиатуру, вступит в силу после перезапуска
zh_hant: 直接按鍵盤進行設定, 重啟後生效

# TbNotChangeSystemProxy
source: Do not change system proxy
ru: Не изменять системный прокси
zh_hant: 不改變系統代理

# TbReset
source: Reset
ru: Обнулить
zh_hant: 重設

# TbSetSystemProxy
source: Set system proxy
ru: Установить системный прокси
zh_hant: 自動配置系統代理

# TbSystemProxyPac
source: Pac Mode
ru: Режим PAC
zh_hant: PAC模式

# menuShareServer
source: Share Server (Ctrl+F)
ru: Поделиться сервером (Ctrl+F)
zh_hant: 分享伺服器 (Ctrl+F)

# menuRouting
source: Routing
ru: Маршрутизация
zh_hant: 路由

source: Not Run As Admin
ru: Пользователь
zh_hant: 以非管理員身份執行

source: Run As Admin
ru: Администратор
zh_hant: 以管理員身份執行

# menuMoveBottom
source: Move to bottom (B)
ru: Спуститься вниз (B)
zh_hant: 下移至底部 (B)

# menuMoveDown
source: Down (D)
ru: Вниз (D)
zh_hant: 下移 (D)

# menuMoveTop
source: Move to top (T)
ru: Подняться наверх (T)
zh_hant: 上移至頂部 (T)

# menuMoveUp
source: Up (U)
ru: Вверх (U)
zh_hant: 上移 (U)

# MsgFilterTitle
source: Filter, support regular
ru: Фильтр, поддерживает regex
zh_hant: 過濾器, 支援正則

# menuWebsiteItem
source: {0} Website
ru: {0} веб-сайт
zh_hant: {0} 官網

# menuRoutingAdvanced
source: Advanced Function
ru: Расширенная функция
zh_hant: 進階功能

# menuRoutingAdvancedAdd
source: Add
ru: Добавить
zh_hant: 新增規則集

# menuRoutingAdvancedImportRules
source: Import Advanced Rules
ru: Добавить расширенные правила
zh_hant: 一鍵匯入進階規則

# menuRoutingAdvancedRemove
source: Remove selected (Delete)
ru: Удалить выбранные
zh_hant: 移除所選規則 (Delete)

# menuRoutingAdvancedSetDefault
source: Set as active rule(Enter)
ru: Установить как активное правило
zh_hant: 設為活動規則 (Enter)

# menuRoutingBasic
source: Basic Function
ru: Основные функции
zh_hant: 基礎功能

# menuRoutingBasicImportRules
source: Import Basic Rules
ru: Импорт основных правил
zh_hant: 一鍵匯入基礎規則

# TbdomainMatcher
source: Domain Matcher
ru: Сопоставитель доменов
zh_hant: 域名匹配演算法

# TbdomainStrategy
source: Domain strategy
ru: Доменная стратегия
zh_hant: 域名解析策略

# TbenableRoutingAdvanced
source: Enable advanced function
ru: Включить расширенные функции
zh_hant: 啟動進階功能

# TbRoutingTabBlock
source: 3.Block Domain or IP
ru: 3.Заблокировать домен или IP
zh_hant: 3.阻止的Domain或IP

# TbRoutingTabDirect
source: 2.Direct Domain or IP
ru: 2.Прямой домен или IP
zh_hant: 2.直連的Domain或IP

# TbRoutingTabProxy
source: 1.Proxy Domain or IP
ru: 1.Прокси-домен или IP
zh_hant: 1.代理的Domain或IP

# TbRoutingTabRuleList
source: Pre-defined Rule Set List
ru: Предустановленный список наборов правил
zh_hant: 預定義規則集列表

# TbRoutingTips
source: *Set the rules, separated by commas (,); The comma in the regular is replaced by <COMMA>
ru: * Установите правила, разделенные запятыми (,); Запятая в регулярке заменена на <COMMA>
zh_hant: *設定的路由規則,用逗號(,)分隔;正則中的逗號用<COMMA>替代

# menuImportRulesFromClipboard
source: Import Rules From Clipboard
ru: Импорт правил из буфера обмена
zh_hant: 從剪貼簿中匯入規則

# menuImportRulesFromFile
source: Import Rules From File
ru: Импорт правил из файла
zh_hant: 從文件中匯入規則

# menuImportRulesFromUrl
source: Import Rules From Sub Url
ru: Импорт правил из URL
zh_hant: 從訂閱URL中匯入規則

# menuRoutingRuleSetting
source: Rule Settings
ru: Настройка правил
zh_hant: 規則集設定

# menuRuleAdd
source: Rule Add
ru: Добавить правило
zh_hant: 新增規則

# menuRuleExportSelected
source: Export Selected Rules
ru: Экспорт выделенных правил
zh_hant: 匯出所選規則至剪貼簿

# menuRuleList
source: Rule List
ru: Список правил
zh_hant: 規則列表

# menuRuleRemove
source: Remove Rules (Delete)
ru: Удалить правила (Delete)
zh_hant: 移除所選規則 (Delete)

# menuRoutingRuleDetailsSetting
source: RoutingRuleDetailsSetting
zh_hant: 路由規則詳情設定

# TbAutoSort
source: Domain, ip, process are auto sorted when saving
ru: Домен и IP автоматически сортируются при сохранении
zh_hant: 儲存時Domain, IP, 行程名 自動排序

# TbRuleobjectDoc
source: Ruleobject Doc
zh_hant: 規則詳細說明文件

# TbDnsObjectDoc
source: Support DnsObject, Click to view the document
ru: Поддержка DnsObject
zh_hant: 支援填寫DnsObject,JSON格式，點擊查看文件

# SubUrlTips
source: Group please leave blank here
ru: Необязательное поле
zh_hant: 普通分組此處請留空

# TipChangeRouting
source: Routing setting is changed
ru: Настройки маршрутизации изменены
zh_hant: 路由設定已改變

# TipChangeSystemProxy
source: System proxy setting is changed
ru: Системные прокси изменены
zh_hant: 系統代理設定已改變

# menuMixedTestServer
source: One-click multi test Latency and speed (Ctrl+E)
ru: Тест задержки и скорости всех серверов (Ctrl+E)
zh_hant: 一鍵多執行緒測試延遲和速度 (Ctrl+E)

# LvTestDelay
source: Delay(ms)
ru: Задержка (ms)
zh_hant: 延遲(ms)

# LvTestSpeed
source: Speed(M/s)
ru: Скорость (M/s)
zh_hant: 速度(M/s)

# FailedToRunCore
source: Failed to run Core, please see the log
ru: Не удалось запустить ядро, посмотрите логи
zh_hant: 執行Core失敗，請看日誌

# LvFilter
source: Remarks regular filter
zh_hant: 別名正則過濾

# TbDisplayLog
source: Display Log
ru: Показать логи
zh_hant: 顯示日誌

# menuImportOldGuiConfig
source: Import old config guiNConfig
ru: Импортировать старый конфиг guiNConfig
zh_hant: 匯入舊的配置檔案guiNConfig

# TbEnableTunAs
source: Enable Tun
ru: Режим VPN
zh_hant: 啟用TUN模式

# TbSettingsNewPort4LAN
source: New Port for LAN
ru: Новый порт для локальной сети
zh_hant: 為區域網路開啟新的埠

# TbSettingsTunMode
source: TunMode settings
ru: Настройки TunMode
zh_hant: TUN模式設定

# TbSettingsTunModeDirectIP
source: Direct IP CIDR, separated by commas (,)
ru: Прямой IP CIDR, разделенный запятыми (,)
zh_hant: 直連的IP CIDR，用逗號(,)分隔

# TbSettingsTunModeDirectProcess
source: Direct Process name, separated by commas (,)
ru: Имя процесса, разделенное запятыми (,)
zh_hant: 直連的行程名，用逗號(,)分隔

# TbSettingsTunModeShowWindow
source: Show console
ru: Показать консоль
zh_hant: 顯示控制台

# menuMoveToGroup
source: Move to group
ru: Перейти в группу
zh_hant: 移至訂閱分組

# TbSettingsTunModeCustomTemplate
source: Custom Template
ru: Пользовательский шаблон
zh_hant: 自訂配置模板

# TbSettingsEnableDragDropSort
source: Enable Server Drag Drop Sort(Require restart)
ru: Включить сортировку перетаскиванием сервера (требуется перезагрузка)
zh_hant: 啟動伺服器拖放排序(需重啟)

# TbAutoRefresh
source: AutoRefresh
ru: Автообновление
zh_hant: 自動重新整理

# SpeedtestingSkip
source: Skip test
ru: Пропустить тест
zh_hant: 跳過測試

# menuEditServer
source: Edit Server (Ctrl+D)
ru: Редактировать сервер (Ctrl+D)
zh_hant: 編輯伺服器 (Ctrl+D)

# TbSettingsDoubleClick2Activate
source: Double-click server make active
ru: Двойной клик чтобы сделать сервер активным
zh_hant: 主介面輕按兩下設為活動伺服器

# SpeedtestingCompleted
source: Test completed
ru: Тест завершен
zh_hant: 測試完成

# TbSettingsDefFingerprint
source: Default TLS fingerprint
ru: TLS отпечаток по умлочанию
zh_hant: 預設TLS指紋(fingerprint)

# TbSettingsDefUserAgent
source: User-Agent
zh_hant: 使用者代理(User-Agent)

# TbSettingsDefUserAgentTips
source: This parameter is valid only for tcp/http and ws
ru: Этот параметр действителен только для TCP/HTTP и WS
zh_hant: 僅對TCP/HTTP、WS協定生效

# TbSettingsCurrentFontFamily
source: FontFamily(Require restart)
ru: Шрифт (требуется перезагрузка)
zh_hant: 目前字型(需重啟)

# TbSettingsCurrentFontFamilyTip
source: Copy the font TTF file to the directory guiFonts, restart the settings
ru: Скопируйте файл шрифта TTF/TTC в каталог guiFonts, перезапустите настройки
zh_hant: 複製字型TTF/TTC文件到目錄guiFonts，重啟設定

# TbSettingsSocksPortTip
source: http port=socks port+1
zh_hant: http端口= +1；Pac端口= +4；*ray API端口= +5；mihomo API端口= +6；

# TbSettingsStartBootTip
source: Set this with admin privileges, get admin privileges after startup
ru: Установите это с правами администратора
zh_hant: 以管理員權限設定此項，在啟動後獲得管理員權限

# TbSettingsFontSize
source: FontSize
ru: Размер шрифта
zh_hant: 字型大小

# TbSettingsTunModeProxyIP
source: Proxy IP CIDR, separated by commas (,)
ru: IP-адрес прокси-сервера CIDR, через запятую (,)
zh_hant: 代理的IP CIDR，用逗號(,)分隔

# TbSettingsTunModeProxyProcess
source: Proxy Process name, separated by commas (,)
ru: Имя прокси-процесса, разделенное запятыми (,)
zh_hant: 代理的行程名，用逗號(,)分隔

# TbSettingsTunModeBypassMode
source: Bypass Mode
ru: Режим обхода
zh_hant: 繞行模式

# TbSettingsSpeedTestTimeout
source: SpeedTest Single Timeout Value
ru: Таймаут одиночного спидтеста
zh_hant: 測速單個超時值

# TbSettingsSpeedTestUrl
source: SpeedTest Url
ru: URL спидтеста
zh_hant: 測速檔案位址

# TbSettingsTunModeDNS
source: DNS object, e.g. {"servers":[]}
ru: DNS-объект, например.
zh_hant: DNS物件，例如 {"servers":[]}

# menuMoveTo
source: Move up and down
ru: Двигайтесь вверх и вниз
zh_hant: 移至上下

# TbSettingsEnableHWA
source: Enable hardware acceleration(Require restart)
ru: Включить аппаратное ускорение (требуется перезагрузка)
zh_hant: 啟用硬體加速(需重啟)

# SpeedtestingWait
source: Waiting for testing
ru: Ожидание тестирования
zh_hant: 等待测试中（按ESC终止）...

# TipDisplayLog
source: Please turn off when there is an abnormal disconnection
ru: Пожалуйста, выключите, если происходит ненормальное отключение
zh_hant: 當有異常斷流時請關閉

# MsgSkipSubscriptionUpdate
source: Updates are not enabled, skip this subscription
ru: Обновления не включены, пропустите эту подписку
zh_hant: 未啟動更新，跳過此訂閱

# menuRebootAsAdmin
source: Reboot as administrator
ru: Перезагрузить как администратор
zh_hant: 以管理員身份重啟

# LvMoreUrl
source: More urls, separated by commas;Subscription conversion will be invalid
ru: Дополнительные URL-адреса, разделенные запятыми; Преобразование подписки будет недействительным.
zh_hant: 更多位址(url)，用逗號(,)分隔；訂閱轉換將失效

# LvAutoUpdateInterval
source: Automatic update interval(minutes)
ru: Интервал автоматического обновления в минутах
zh_hant: 自動更新間隔(分鐘)

# TbSettingsLogEnabledToFile
source: Enable logging to file
ru: Включить логгирование в файл
zh_hant: 啟動日誌存到文件

# LvConvertTarget
source: Convert target type
ru: Преобразовать тип цели
zh_hant: 訂閱轉換目標類型

# LvConvertTargetTip
source: Please leave blank if no conversion is required
ru: Оставьте поле пустым, если преобразование не требуется.
zh_hant: 不需要轉換時請留空

# menuDNSSetting
source: DNS Settings
ru: Настройки DNS
zh_hant: DNS設定

# TbSettingsCoreDnsSingbox
source: sing-box DNS settings
ru: Настройки DNS sing-box
zh_hant: sing-box DNS設定

# TbDnsSingboxObjectDoc
source: Please fill in DNS Structure, Click to view the document
ru: Пожалуйста, заполните структуру DNS. Нажмите, чтобы просмотреть документ.
zh_hant: 請填寫 DNS JSON 結構，點擊查看文件

# TbdomainStrategy4Singbox
source: sing-box domain strategy
ru: стратегия домена «sing-box»
zh_hant: sing-box域名解析策略

# TbSettingsMux4SboxProtocol
source: sing-box Mux Protocol
ru: Протокол мультиплексирования Sing-Box
zh_hant: sing-box Mux 多路復用協定

# TbRoutingRuleProcess
source: Full process name (Tun mode)
ru: Полное имя процесса (режим Tun)
zh_hant: 行程名全稱 (TUN模式)

# TbRoutingRuleIP
source: IP or IP CIDR
ru: IP или IP CIDR
zh_hant: IP 或 IP CIDR

# TransportPathTip2
source: *h2 path
ru: *h2 путь

# menuPingServer
source: Test servers ping (Ctrl+P)
ru: Тест на задержку сервера (Ctrl+P)

# TbFingerprint
source: Fingerprint
ru: Отпечаток

# TbSettingsRouteOnly
source: RouteOnly
ru: Только маршрут

# TbPublicKey
source: PublicKey
ru: Публичный ключ

# TbSpiderX
source: SpiderX
ru: ПаукX

# TbRoutingRuleDomain
source: Domain
ru: Домен
